{
    "url": "https://www.clorox.com/learn/when-is-bleach-dispensed-to-wash-cycle-washing-machine/",
    "title": "When is Bleach Dispensed to Wash Cycle in Washer? | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nWhen is Bleach Dispensed to Wash Cycle in Washing Machine?\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nIt seems by reading the manual that comes with the Kenmore Elite HE washer that the bleach actually disperses only in the rinse cycle as opposed to the wash cycle. Is this a correct interpretation for all front loading machines? This is a big departure from having the bleach mix with the soap in the wash cycle at the beginning using a regular washing machine – any comments or advice? Big bleach users should be aware before buying.\nAnswer\nWOW. It’s amazing that somebody actually reads those manuals. Getting to know your new HE washer is a great idea as they are very different from the old top loaders.\nMany things are different about liquid bleach usage in HE washers:\nThe bleach dispenser is located with all the other dispensers, and its small size can lead to challenges getting product into it\nThe bleach amount in the dispenser is less than the toploaders\nYou can’t add liquid bleach directly to the washer once it’s started\nThe liquid bleach is usually dispensed at the beginning of a rinse cycle rather than added with detergent, as with top loaders\nThe rationale for the later/rinse addition is that the detergent has done a lot of cleaning and the liquid bleach can work with or without the detergent. Adding in the first rinse should do a good job of finishing the cleaning, whitening and now disinfecting the clothes.\nAdvice- add as much bleach as possible since the HE washers also have larger clothes capacity and you want to get the best cleaning results.\nHope this helps and let me know if you have any further questions.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}