{
    "url": "https://www.clorox.com/learn/how-to-get-poop-smell-out-of-clothes/",
    "title": "How to Get Poop Smell Out of Clothes | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Get Poop Smell Out of Clothes\nAccidents happen and some accidents don't just look bad, they smell bad also. Learn how to remove the poop smell from your clothes and laundry.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nI am potty training and my children seem to have accidents. It can stink pretty bad and is hard to get the smell out in the laundry. It’s not just in the underwear but in the blue jeans or pants they are wearing as well. I don’t have an issue bleaching the underwear, but obviously don’t want to bleach jeans or colored pants. What can I do to get rid of the smell?\nAnswer\nOh the memories… I noticed from your question that you said you are potty training children, so it sounds like you may have twins—it was a big enough challenge for me training one child at a time! I have some good news for you—more often than not, denim blue jeans can be safely laundered with\nClorox® Disinfecting Bleach\n. You can use the bleachability test to check first. Just add 2 teaspoons\nClorox® Disinfecting Bleach\nto ¼ cup water and apply a drop of that solution to a hidden part of the blue jeans (like inside the pocket facing, or the inside hem). Wait one minute then blot dry—no color change means you can safely bleach the blue jeans! You may also find that if the jeans fade slightly where the drop of test solution was applied, the color change is minimal and something you can live with. You can also use this test to confirm bleachability of the other colored pants—just don’t bother testing leggings or other pants that have spandex in them (check the care label) since spandex will yellow when bleached. Surprisingly, khaki pants are also often bleachable, just be sure to check first because it varies from brand to brand.\nFor pants that can’t be safely laundered with regular bleach, you can wash them with detergent and\nClorox 2® for Colors Stain Remover and Laundry Additive\n. Always rinse away any solids prior to laundering. Be sure to select a hot wash temperature and the heavy duty cycle to get the pants as clean as possible, and sanitize them by adding\nClorox® Laundry Sanitizer\nto the softener dispenser. This product is appropriate for all machine washable laundry, including colors.\nOf course you can also limit your kids to wearing only bleachable pants until they are potty trained!\nRelated products\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}