{
    "url": "https://www.clorox.com/learn/what-is-bleach-what-are-active-ingredients/",
    "title": "What Is Bleach and What Are Its Active Ingredients? | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nWhat Is Bleach and What Are Its Active Ingredients?\nTrusted for generations to clean, whiten and disinfect, bleach is a product many people have heard of, yet don’t know much about. We want to change that, starting at the top with sodium hypochlorite.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nThe bleach active in\nClorox® Bleach\nis sodium hypochlorite (NaOCl). Historically, our bleach was made in a simple process beginning with passing an electric current through salt water to produce sodium hydroxide (NaOH) and chlorine gas (Cl2); these two products are then combined, producing sodium hypochlorite bleach\nIn fact, The Clorox Company’s headquarters has always been in Oakland, California where the company founders first used the salt water from San Francisco Bay to make bleach! Once it encounters organic material (like dirt) or heat or sunlight, bleach very rapidly breaks down into salt (NaCl) and water, where it all began.\nWhere bleach comes from, starting and ending as salt water, is a big part of what makes bleach environmentally friendly.\nOther important bleach ingredients\nThe right formulation makes all the difference\nSodium hypochlorite works best when it’s part of a complete formula with ingredients to enhance the bleach active. In addition to sodium hypochlorite and water, small amounts of sodium chloride, sodium carbonate and sodium hydroxide are included for product stability and to maintain pH.\nSodium chlorate is naturally present in small amounts as an intermediate molecule during the natural breakdown of bleach to saltwater. Polyacrylic acid is included as an anti-redeposition agent. And finally, a polyelectrolyte complex improves brightening.\nRelated Articles\nThe Difference Between Chlorine and Non-Chlorine Bleach\nHow does bleach work?\nEffective and economical, bleach gets the job done\nSodium hypochlorite hydrolyzes double bonds, breaking up soils and stains to make it easier for the laundry detergent to do its job getting clothes clean. That’s why adding bleach along with your regular detergent doesn’t just sanitize the laundry; it also gets clothes cleaner and whiter than washing with detergent by itself. For household disinfection, sodium hypochlorite’s ability to denature proteins makes it highly effective at killing bacteria, viruses and fungi.\nRelated Articles\nSurprising Uses for Bleach\nUse bleach as directed\nProper use ensures that bleach performs as promised\nClorox® Disinfecting Bleach\nshould always be diluted with water first before using. When mixing up a bleach and water solution for home disinfection, use the amount of bleach and water recommended for your specific task. Be sure to allow the solution enough time to work, leaving it on surfaces for the necessary amount of time, and rinsing if required. And finally, bleach products have a one-year shelf life when stored in a cool dry place away from direct sunlight.\nRelated Articles\nHow to Sanitize Clothes, Bed Sheets and Towels\nBleach Dilution Ratio Chart for Disinfecting\nHow to Wash and Sanitize Dishes with Bleach\nFrequently Asked Questions\nWhat is bleach made of?\nBleach is made of mostly water and sodium hypochlorite, the active ingredient that cleans and kills germs. Other ingredients are included in very small amounts to stabilize the formula and improve cleaning and whitening.\nWhat is the active ingredient in bleach?\nSodium hypochlorite, which has a chemical formula of NaOCl, is the active ingredient in all of our hypochlorite-based products. All of our EPA-registered products list the concentration of sodium hypochlorite on the product label.\nAre Clorox and bleach the same thing?\nIt’s common for people to use “bleach” and “Clorox” interchangeably because Clorox® Bleach was the first product the company produced and sold 109 years ago. Store-brand bleach products made by other companies are not even close to the quality of our products, so if you want Clorox® Bleach, make sure that’s the brand you buy.\nWhere can I find information on the ingredients in other Clorox products?\nThe Clorox Company has been very proactive at voluntarily providing consumers with ingredient information for our products. Today, using the Smart Label Program, you can access the ingredients of over 500 of our products by starting\nhere\n.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}