{
    "url": "https://www.clorox.com/learn/how-to-clean-mold-mildew-outside-bleach/",
    "title": "How to Clean Mold & Mildew Outside With Bleach | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Clean Mold & Mildew Outside With Bleach\nFollow these mixing instructions to create a bleach solution to kill exterior mold and mildew, clean mold off gutters, and clean the outside of your house.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nHow to Clean Outdoor Mold & Mildew\nYou’ll need:\n5 gallon bucket\nClorox® Disinfecting Bleach\nMeasuring cup\nRubber gloves\nSafety glasses\nScrubbing brushes (long handle and/or handheld)\nGarden hose with spray nozzle\nHere’s the procedure:\nThoroughly water any plants near the area where you will be working. Protect larger plants by covering them with plastic sheeting.\nAdd ⅓ cup\nClorox® Disinfecting Bleach\nto 1 gallon water in the 5 gallon bucket. For larger jobs, use 1 cup bleach added to 3 gallons of water.\nPre-wet the surface to be cleaned with water\nApply the bleach and water solution to the surface with a scrub brush.\nReapply as needed to keep the surface wet for up to 10 minutes\nRinse the treated area thoroughly\nLet surfaces air dry\nRe-water any nearby plants that may be getting run-off\nAny leftover bleach and water solution can be easily flushed down the toilet. Rinse out your brushes and rinse off your gloves and boots with the garden hose, and let everything air dry. You can also use this technique to clean siding, as well as sealed brick and patio stones. Note that you should avoid applying the bleach solution in direct sunlight or to unfinished wood. The solution should not be used for aluminum gutters or windows; rinse thoroughly if any contact occurs. You should also test the bleach solution on the area you want to treat in an inconspicuous area before starting your project. Sure, it sounds easy enough, and really, it actually is! Here’s a picture tutorial to help you see how it’s done.\nMold and mildew builds up a little at a time over the winter. There’s less daylight and lousy weather, making it easier to put off dealing with (until you can’t any longer!).\nUse a large plastic tarp to protect the plants.\nTo make up 3 gallons of the bleach solution, use 1 cup of bleach. This makes it easier to dip a long handled brush into the solution. Measure water into the bucket and mark volume lines on the outside so it’s easy to just use the hose to fill the bucket to the correct volume. No guessing as to how much a gallon is!\nWet the surface with a garden hose. When it’s wet, the discoloration looks even worse.\nThe less you have to think about what you are wearing while you are working the better. Rubber rain boots and old clothes that you won’t mind getting any bleach splashes on are perfect.\nUse a long-handled brush to apply (and reapply by just dipping the brush back in the bucket) the bleach solution to the wall.\nSome corners really can only be scrubbed with a hand-held brush. The gloves are really nice to have here:\nIf you have a large area to clean, don’t try to do it all at once. To stay within the recommended 10 minutes of contact time, work in smaller sections, rinsing the first area before starting again on the next.\nWow — what a difference!\nThanks,\nClorox® Disinfecting Bleach\n! I couldn’t have done it without you!\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}