{
    "url": "https://www.clorox.com/learn/water-purification-how-much-bleach-purify-water-for-drinking/",
    "title": "How to Disinfect and Purify Drinking Water with Bleach | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Disinfect and Purify Drinking Water with Bleach\nIn emergency situations, it’s important to know how to purify water. When boiling isn’t an option, you can make purified water by adding the right ratio of bleach.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nOnly treat drinking water with bleach if boiling for 1 minute isn’t practical. Once you know the correct dilution ratios, you can purify water with bleach by following the steps below.\nRelated Articles\nHow to Clean, Sanitize & Disinfect Water Bottles\nWhat you need\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nClean cloth, towel or coffee filter\nClean watertight container\nMeasuring spoon\nStirring utensil\nSteps to disinfect water with bleach\nRemove any debris\nRemove all suspended material by filtration using a clean cloth, towel, coffee filter or by letting it settle to the bottom of the container.\nTip\nCheck with your water service provider to confirm that your tap water is safe to drink. If you stocked up on bottled water, save the empty bottles. You can use some of them to collect untreated water or to store the water you treat.\nPour water into container\nPour clearest water into a clean container.\nTreat water\nAdd 25 drops or ¼ teaspoon of Clorox® Disinfecting Bleach to 1.75 gallons of water (4 drops to 1 quart).  Stir thoroughly.\nTip\nOnly use regular, unscented chlorine.\nWait\nAllow the treated water to stand for 30 minutes. Properly treated water will have a slight chlorine odor.\nRepeat as needed\nIf there’s no chlorine odor, you’ll need to repeat the treatment. Add the same amount of bleach and wait for another 15 minutes. Check again for the chlorine odor before drinking water.\nThe treated water can then be made palatable by pouring in between clean containers several times.\nIf the water is contaminated with a chemical, adding the product will not make it drinkable.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}