{
    "url": "https://www.clorox.com/learn/how-long-do-covid-and-flu-germs-live-on-surfaces/",
    "title": "How Long Do Covid and Flu Germs Live on Surfaces  &nbsp; | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow Long Do Covid* and Flu Germs Live on Surfaces\nHow long viruses that can cause the common cold, flu and Covid* may survive on a surface varies. Knowing how long a virus “lives” helps inform when to disinfect surfaces and help stop the spread of illness.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nSurface transmission (touching virus droplets deposited on a surface and then touching your eyes, nose or mouth) is one way that viral illness spreads from person to person.\nFor example, when a contagious person coughs or sneezes on a surface like a kitchen countertop, they leave behind droplets that contain the virus. Viruses survive on surfaces for different amounts of time, depending on the type of surface, the type of virus and various environmental factors. Disinfecting hard, nonporous surfaces interrupts the chain of transmission and helps to prevent the spread of illness.\nRelated Articles\nThe Cold, Flu, RSV and COVID-19 Virus: What's the Difference?\nDoes Bleach Kill COVID-19 and Other Viruses, Bacteria and Germs?\nHow Products Are Tested to Determine COVID-19 Virus Killing Claims\nSARS-CoV-2 survival on surfaces\nAcross different research studies, survival time for SARS-CoV-2 (the virus that causes Covid-19) varies widely from hours to weeks depending on the study. To develop more specific guidance from this data, the Centers for Disease Control factors in the environment (like air flow and temperature) and the likely viral load in respiratory droplets.\nOn nonporous surfaces like stainless steel, plastic and glass, the virus can last up to 3 days in a typical indoor environment. On porous surfaces like cotton fabric, the survival time is shorter, up to a day.\n1\nCold and flu virus survival on surfaces\nDepending on where cold and flu virus droplets fall, they can last from hours to days,\n2\nand up to 48 hours.\n3\nThey last longer on non-porous surfaces than porous surfaces. As with SARS-CoV-2, the viral load in any droplets that fall on surfaces—along with temperature and humidity — impact how easily a virus can spread to another person who touches the droplet then touches their eyes, nose, or mouth.\nSurface disinfection helps stop viruses from spreading\nAlong with frequent handwashing (especially after contact with a sick person or handling their laundry), cleaning and disinfecting hard, nonporous surfaces during the time window where the virus remains viable after exposure (up to 3 days for Covid, and up to 2 days for the cold or flu) will help prevent infection.\nDisinfectant products should be registered with the EPA and known to kill cold, flu and SARS-CoV-2 viruses. For laundry, select the hottest temperature possible and add the appropriate laundry additive to get clothes and bedding as clean as possible.\nRelated products\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nClorox®\nDisinfecting Wipes₁\nLearn more\nClorox®\nDisinfecting Mist, Multi-Surface\nLearn more\nClorox®\nToilet Bowl Cleaner – with Bleach\nLearn more\n*\nIllness caused by SARS-CoV-2\n1.\nhttps://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/how-covid-spreads.html\n2.\nhttps://www.mayoclinic.org/diseases-conditions/flu/expert-answers/infectious-disease/faq-20057907\n3.\nhttps://www.cdc.gov/flu/resource-center/images/multi-language-pdfs/contamination_cleaning_english_508.pdf\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}