{
    "url": "https://www.clorox.com/learn/can-you-bleach-off-white-ivory-cream-colored-sheets/",
    "title": "Can You Bleach Off White, Ivory, and Cream Sheets? | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nCan You Bleach Off White, Ivory, and Cream Colored Sheets?\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nI recently purchased 600 thread count, cream-colored sheets and have been using them ever since. Unfortunately, my husband is a warm sleeper and now there are yellowed areas on our new sheets. Is it safe to bleach them?\nAnswer\nBecause the sheets are 100% cotton, you can definitely launder them with bleach and not damage the cotton fibers.  What you don’t know is whether or not the cream color is colorfast to bleach. You can test the sheets with a quick bleachability test using\nClorox® Disinfecting Bleach\n. First, add 2 teaspoons of bleach to ¼ cup water and apply a drop to a hidden part of the sheets (like the part that gets tucked into the mattress). Be sure to test any trim on the sheets, too. Wait 1 minute, blot dry, and look for a color change. No color change means you can safely bleach the sheets.\nAssuming the sheets pass, here are some tips to help you get the stains out. For the wash water temperature, I would use hot water, as well as a “regular” cycle.  A higher wash temperature and increased agitation will definitely improve cleaning. I would also pretreat the stained areas with a little liquid laundry detergent prior to washing to break up any oily body soil that’s part of the sweat stains.  Just apply a little of the detergent directly to the stains and rub in. Wait 5 minutes, ensuring the detergent doesn’t dry on the fabric, and then wash the sheets in hot water using detergent and ¾ cup\nClorox® Disinfecting Bleach\n. When complete, air dry the sheets—I always  recommend air drying items that had stains so you can be sure they are all the way out before tumble drying items in a hot dryer (which can permanently heat set some stains). This should do the trick, but if the stains have been building up over time and have been in and out of a hot dryer since last fall, then you may need to repeat the treatment for complete success.\nIf the sheets don’t pass the bleachability test, then you can try using\nClorox 2® for Colors Stain Remover and Laundry Additive\n.  Presoaking with the powder will be especially beneficial, especially if you can soak the sheets overnight in a deep fill washer. Select hot water and add a couple of scoops to the empty washer as it’s filling with water. Swirl the agitator to dissolve the powder, and then fully submerge the sheets. Allow the sheets to soak overnight, and the next day drain the soaking solution.  Wash the sheets in hot water using detergent and more\nClorox 2®\n.\nRelated products\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}