{
    "url": "https://www.clorox.com/learn/how-to-remove-dye-transfer-stains-from-clothes/",
    "title": "How To Remove Dye Transfer Stains from Clothes | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow To Remove Dye Transfer Stains from Clothes\nDiscover how to get dye and color transfer stains out of your colored clothes, white clothes, and clothes after drying with our dye transfer removal process.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nI accidentally threw my girls’ clothes with a black dress of mine and all of their clothes now have a gray tint! I washed it a couple of times with vinegar (home remedy I read online) and it was no help. I’m getting ready to wash it with Clorox2, do you think that will do it?\nAnswer\nUnfortunately\nClorox 2® for Colors Stain Remover and Laundry Additive\nis a little too gentle to strip away the unwanted color.  However, depending on the fiber content of the items that picked up the unwanted color, you may be able to restore the items with a diluted bleach and water solution using\nClorox® Disinfecting Bleach\n.  Not knowing all the specifics of the items, it’s best to provide you some general information that you can adjust to your situation.\nFor white items that picked up color, first check each care label to identify the fiber content of each item so you know which ones are bleachable. You should always avoid bleaching wool, silk, mohair, leather, and spandex.  The first four are less commonly machine washed, but spandex (also called Elastane or Lycra) is sometimes included in garments and even small percentages shouldn’t be bleached.  For those fabrics that can be bleached, you should be able to restore them using a bleach soaking solution. Start by adding ¼ cup\nClorox® Disinfecting Bleach\nto one gallon of water in a plastic dishpan. Fully submerge items in the bleach solution for up to 5 minutes. You may notice the color coming off immediately, or it may take the full 5 minutes (but don’t let any item soak for longer than 5 minutes). If you have a lot of items, it’s better to do them one at a time, transferring each item as you finish to a second dishpan that you can immediately rinse the item in.  If you have only one item, then after 5 minutes just drain the soaking solution and thoroughly rinse the item—you can also just run it through a regular wash cycle with a little detergent and ⅓ cup\nClorox® Disinfecting Bleach\n.  Hopefully the unwanted color will be gone, but if it is lighter, then you can repeat the soak for eventual success.\nFor colored items that picked up the unwanted color (or white items that include spandex) you can try RIT Color Remover, which is available at craft and fabric stores, as well as some drug stores.  When using RIT for this purpose, the trick is to mix up the solution so it is just strong enough to remove the unwanted color, but not so strong that it strips off the original item color. You’ll be working with your hands in the solution so be sure to wear gloves. Start with a very weak solution by just using only a small amount of the powder, not the whole package, and dissolve it into a gallon of water in a plastic dishpan. Dip the garment (all of it) into the solution and check to see if the unwanted color comes off. The quicker you do this the more likely you will preserve the original color. Hopefully the color will come off right away and you can quickly rinse the garment very thoroughly in a little warm water. If the RIT solution is too strong, you will see the original color coming off right away, so if that’s the case rinse the item as fast as you can.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}