{
    "url": "https://www.clorox.com/learn/how-to-wash-shoes-and-kids-sneakers/",
    "title": "How to Wash Shoes & Kid's Sneakers | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Wash Shoes and Kid's Sneakers\nNothing seems to pick up dirt, stains and stink faster than a shiny new pair of shoes. We’ll show you how to get those dirty sneakers clean again, either by hand or with a machine wash.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nWhether it’s from dirt, mud, grass or food stains, kids’ canvas shoes and sneakers can get dirty pretty quickly. To keep them clean and your kids looking their best, start by routinely wiping shoes down with\nClorox® Disinfecting Wipes\n, especially white midsoles. You can also use\nClorox® Disinfecting Mist\nto keep odors under control in between washings. Eventually, kids’ shoes and sneakers get dirty enough to hand wash to get them really clean or, if allowed, you can machine wash cloth, canvas and mesh shoes.\nRelated Articles\nHow to Clean White Canvas Shoes\nCheck the care instructions first\nBefore washing your shoes, it’s always a good idea to check any care instructions first. However, this information is not usually readily available on the shoes themselves because shoes are exempt from the\nCare Labeling Act\nand are not required to have a permanent care label the same way clothes are.\nSometimes care instructions are on the box; if you no longer have the packaging, you can often find care information on shoe brand websites. It may take a little digging, but it’s useful information, especially since care recommendations vary from brand to brand.\nWhen in doubt about the best way to care for your shoes, always test the products you want to try on a hidden part of the shoe before proceeding.\nWhat you need to hand wash canvas shoes and sneakers\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nClorox®\nDisinfecting Mist, Multi-Surface\nLearn more\nNylon brush or old toothbrush\nPaper towels\nFan\nSteps to hand wash canvas shoes and sneakers\nRemove shoelaces and insoles\nIf the shoes have removable laces and/or insoles remove them and set them aside for cleaning.\nTip\nOnly wash shoelaces made of cotton, polyester or nylon; don’t wash leather shoelaces.\nBrush away obvious dirt\nBrush away loose soils and dirt from the shoes with a dry nylon brush.\nTip\nMake sure the shoes are dry when you brush off loose dirt.\nMix the cleaning solution\nAdd 1 capful of liquid\nClorox 2® for Colors\nto 1 quart of water.\nTip\nUse Clorox 2® full strength for pretreating obvious stains.\nScrub the outside\nDip the brush in the cleaning solution and scrub the outside of the shoe starting at the top of the upper portion of the shoe and working your way down toward the midsoles. Scrub gently with a circular motion, dipping the toothbrush in the solution as needed to apply additional cleaning solution.\nTip\nWork on one shoe at a time before rinsing.\nRinse the shoes\nRun each shoe under water from the faucet in the sink until all the cleaning solution is rinsed away.\nClean the soles\nClean the midsole and outsole with the cleaning solution scrubbing with the nylon brush, then rinse the shoes again.\nAir dry the shoes\nStuff each shoe with a few paper towels and place away from sunlight in a warm room with a fan nearby to circulate air and speed up drying time.\nTip\nReplace paper towels in the shoes when they become damp. When no more moisture transfers to the paper towels, remove then while the shoes finish air drying.\nClean the insoles\nWhile the shoes are air drying, use the cleaning solution to gently scrub the insoles with the nylon brush, and then rinse and set aside to air dry with the shoes.\nClean the laces\nWhile the shoes are air drying, soak the shoelaces in the cleaning solution for 1 hour, then rinse thoroughly and allow to air dry with the shoes.\nSanitize\nOnce the shoes, laces, and insoles are completely dry, reassemble the shoe before spraying with\nClorox® Disinfecting Mist\n.\nTip\nSurfaces must remain visibly wet for 2 minutes to sanitize before air drying.\nWhile hand washing is the ideal method for cleaning shoes, many people still want the convenience of machine washing, and may opt to wash shoes made with cotton, polyester or nylon if they don’t want to deal with hand washing. A lower wash temperature, a delicate cycle, and a mesh laundry bag help protect shoes in the washing machine, and might help free up more time without negatively impacting the shoes.\nWhat you need to machine wash shoes and sneakers\nClorox®\nFabric Sanitizer Spray\nLearn more\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nLaundry detergent\nMesh laundry bags\nNylon brush or old toothbrush\nOld towels\nFan\nSteps to machine wash canvas shoes and sneakers\nRemove insoles\nIf the shoes have removable insoles take them out and set them aside for cleaning.\nRemove shoelaces\nRemove any shoelaces, spray them with\nClorox® Fabric Sanitizer Spray\nand transfer them to small mesh laundry bag.\nTip\nOnly wash shoelaces made of cotton, polyester or nylon; don’t wash leather shoelaces.\nBrush away obvious dirt\nBrush away loose soils and dirt from the shoes with a dry nylon brush.\nTip\nMake sure the shoes are dry when you brush off loose dirt.\nPre-treat the shoes\nSpray the shoes all over with\nClorox® Fabric Sanitizer Spray\n.\nTip\nLet stand for 3 minutes to sanitize and 5 minutes for stain removal. Do not let the product dry out on the shoes.\nInsert shoes in the mesh laundry bag\nPlace the shoes in a mesh laundry bag and close it securely. Add it to your clothes washer along with a 1–2 old towels to help balance the washer.\nTip\nAdd the shoelaces in their own mesh bag at the same time.\nRun the cycle\nSelect cold water and the delicate cycle, add\nClorox 2® for Colors\nalong with your regular detergent, then start the washer.\nClean the insoles\nWhile the wash cycle is running, spray the insoles with\nClorox® Fabric Sanitizer Spray\nand scrub gently with the nylon brush, and then rinse.\nAir dry the shoes, laces and insoles\nStuff each shoe with a few paper towels and place away from sunlight in a warm room with a fan nearby to circulate air and speed up drying time. The shoes can also air dry outside on a warm day in the shade.\nTip\nReplace paper towels in the shoes when they become damp. When no more moisture transfers to the paper towels, remove then while the shoes finish air drying.\nFrequently Asked Questions\nCan you put shoes in the washer?\nOnly a few shoe manufacturers recommend machine washing; many more recommend hand washing or spot cleaning for shoe care. This is usually to protect the materials used to construct the shoe, like glue that holds the uppers to the midsole, and to prevent shrinkage, but it can also be to preserve materials like leather or beading or even silk.\nCan you put shoes in the dryer?\nRegardless of how you wash shoes and sneakers, keep them out of the dryer unless recommended specifically by the manufacturer. High dryer heat can damage shoes, so letting them air dry is usually the way to go.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}