{
    "url": "https://www.clorox.com/learn/can-you-put-bleach-in-carpet-cleaner/",
    "title": "Can You Put Bleach in a Carpet Cleaner? | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nCan You Put Bleach in a Carpet Cleaner?\nCleaning your carpet? Find out whether or not it's a good idea to use bleach in a carpet cleaning machine when you're cleaning your carpet.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nCan I add Clorox to the steam cleaner I rented?\n—Anonymous\nAnswer\nHi There!\nI know you can mix up a bleach and water solution for a power washer, but I am not so sure about steam cleaners. I have never tried it. It would be especially problematic if any bleach carried over to the next user and he is washing a wool carpet or rug.\nWhat stain are you trying to clean? And are there any guidelines from the equipment manufacturer?\nIt would be good to know if any of the sprayer mechanism parts have metal components that are not safe for bleach; if that’s the case, they could react with the bleach and actually discolor your carpet!\nThe way these machines work, they spray a cleaning solution onto the carpet and then suck it back off again almost immediately. But a little cleaning solution does get left behind, so you would definitely need a separate rinsing step.\nIf you do decide to give it a try, first make sure it is safe for your carpet (you can’t bleach wool). Dilute the bleach with water before adding it to the machine (never use bleach full strength!).\nFor basic cleaning, use a 185 ppm available chlorine solution, which you make by mixing 2 teaspoons\nClorox® Disinfecting Bleach\nwith 1 gallon of water. Test a small discreet part of the carpet first to decide if you should continue. It’s pretty likely that the spot you clean will get super clean, so you probably need to clean the entire room . Make sure the room is well ventilated and you wear safety glasses, gloves, and clothing you don’t mind getting bleach on. You also need to pace your work so you don’t let the bleach and water sit on the carpet for more than 10 minutes, after which you should go over the carpet again, to rinse it. You will want a different solution to rinse the carpet; a 1:10 solution of hydrogen peroxide and water will both neutralize any bleach solution remaining on the carpet and rinse it. Then you need to make sure the carpet dries quickly so setting up some fans to circulate air will help.\nI can’t confirm that is a good idea — there are so many factors to consider. If the alternative is replacing the carpet, then you certainly have nothing to lose. If you are trying to clean a carpet that was heavily soiled by recent floods, at a minimum the carpet pad will need to be replaced and the bottom of the carpet and subfloor cleaned as well.\nFeel free to share a little more about your situation, and let me know if you have other questions. Good luck, and let me know how it goes.\n—Dr. Laundry\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}