{
    "url": "https://www.clorox.com/learn/how-to-clean-sink-with-bleach/",
    "title": "How to Clean a Sink with Bleach  &nbsp; | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Clean a Kitchen or Bathroom Sink with Bleach\nIt’s easy to use Clorox® Bleach to clean porcelain and stainless steel sinks in the kitchen or bathroom. Use as directed to safely rinse bleach down the sink drain.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nWhen it’s time to clean your sink, the right bleach and water solution makes it easy. It’s as simple as mixing up the solution, wiping it on, waiting for the bleach to work, then rinsing it off. You can even mix up the bleach solution right in the sink where you will be using it. And because\nClorox® Disinfecting Bleach\nis safe for septic systems, you can clean and disinfect all your sinks with confidence.\nIf you want a germ-killing cleaning solution with the convenience of a ready-to-use spray, try\nClorox® Clean-Up® Cleaner + Bleach\n. Just remove excess dirt, and spray Clean-Up® Cleaner 4–6 inches from the surface until thoroughly wet. Let stand for 30 seconds, then rinse or wipe clean. The trusted disinfecting power you need, all in a convenient spray.\nRelated Articles\nHow to clean your sink with bleach\nFollow these simple steps and make it easy to use\nClorox® Disinfecting Bleach\nto clean and disinfect kitchen and bathroom sinks.\nFor use on hard, nonporous surfaces.\nDo not use on aluminum, chipped or cracked enamel, copper, brass, silver or unsealed wood, marble, tile or granite.\nWhat you need\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nDrain cover\nProtective gloves\nMeasuring cup\nPlastic bucket (optional)\nScrubber sponge\nSteps to clean a sink with bleach\nRinse the sink\nUse clean water to rinse all the surfaces in the sink, including the fixtures.\nPlug the drain\nPull up on the stopper or install the drain cover. For combination strainer/covers, close the strainer so no water flows through.\nTip\nIf your drain cover is missing, you can make one using plastic wrap and a saucer. Lay a large square of plastic wrap over the drain, then set the saucer over the plastic wrap to seal the drain.\nMix the bleach and water solution\nUse the measuring cup to add 1 gallon of cool water to the sink, then add 1/3 cup\nClorox® Disinfecting Bleach\n.\nTip\nYou can mix the solution in a plastic bucket if you prefer. This is a good option when cleaning multiple sinks at the same time.\nWipe sink surfaces\nUse the scrubber sponge to wipe the sink bowl and the fixtures with the bleach and water solution. Re-wipe as needed to keep surfaces wet for 6 minutes to disinfect.\nDrain and rinse\nRemove the drain cover and allow the bleach solution to drain away. Rinse the sponge with clean water before using it to wipe the sink and fixtures with clean water.\nAir dry\nSkip drying with a towel and instead let surfaces air dry.\nFrequently Asked Questions\nCan I use this solution to clean countertops at the same time?\nYes, as long as your countertop is made of a bleach-safe material like sealed granite or glazed ceramic tile. Don’t use the solution on marble countertops or porous tile.\nRelated Article\nHow to Clean Countertops with Bleach\nIs it safe to put bleach in a kitchen sink?\nYes, as long as the sink is made of a material that is safe for bleach like porcelain, sealed granite or stainless steel. If your sink is made of marble or copper, check the use and care guide provided by the manufacturer to see what cleaning products are recommended.\nIs bleach safe for septic systems?\nYes — you can safely use\nClorox® Disinfecting Bleach\neven if your home has a septic system. Because bleach breaks down rapidly into salt and water in the presence of organic matter, bleach degrades very quickly in a septic system.\nCan I use Clorox® Clean-Up® Cleaner + Bleach?\nYes,\nClorox® Clean-Up® Cleaner + Bleach\nis great for cleaning most hard, nonporous surfaces when used as directed. Start by removing excess dirt, then spray Clean-Up® Cleaner 4–6 inches from the surface until thoroughly wet. Let stand for 30 seconds, then rinse or wipe clean.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}