{
    "url": "https://www.clorox.com/learn/how-to-get-red-wine-out-of-carpet/",
    "title": "How to Get Red Wine Out of Carpet in 5 Easy Steps | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Get Red Wine Out of Carpet in 5 Easy Steps\nSpill your merlot on your carpet? Follow our red wine stain removal steps to learn how to get it out of synthetic carpet.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nIt happens to the best of us: a wine stain on the carpet — the horror! The good news is we’re here to help get it out. The bad news is you probably will have to bring in a professional carpet cleaner to get your carpet looking good as new (especially if it’s a wool carpet). But there are a few things you can do now to increase the chances of eventual success.\nRelated Articles\nHow to Get Red Wine Out of Clothes\nWhat you need\nClorox®\nUrine Remover\nLearn more\nClub soda\nTowels\nSteps to remove red wine from synthetic carpet\nBlot the stain\nUsing a clean white towel, blot as much of the wine as possible to absorb the excess liquid.\nApply club soda to stain\nOnce no more wine absorbs onto the towel, pour a little club soda onto the stain to lighten it.\nBlot again\nBlot up the soda/wine mixture within a few minutes of putting the club soda on; use another clean white towel if you need to.\nApply Clorox® Urine Remover\nSpray directly onto stain until completely covered.\nBlot (again)\nBlot with a clean damp cloth to rinse.\nIf you have one, you can also use a steam cleaner to treat the stain (follow the directions on product). Be sure to only keep the cleaner on the carpet for whatever time the manufacturer recommends, and then vacuum the treated spot.\nFrequently Asked Questions\nHow do I get wine stains out of wool carpet?\nWool carpet should only be treated by professionals. The wool material is more absorbent than synthetic fibers and is more likely to hold onto the stain. And as wool tends to be more expensive, it’s best to let the professionals do the job so that you can retain its value with minimum damage.\nWhat if I don’t know what my carpet is made of?\nIn this case, we recommend playing it safe by calling the professionals. They’ll be able to assess the situation and treat it accordingly.\nWhat if the stain is old?\nWe recommend still trying the steps above; Clorox® Urine Remover is a powerful stain remover! But the longer you wait, the more likely you’ll need a professional.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}