{
    "url": "https://www.clorox.com/learn/can-you-use-bleach-on-carpet-to-remove-urine-stains/",
    "title": "Can You Use Bleach on Carpet to Remove Urine Stains? | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nCan You Use Bleach on Carpet to Remove Urine Stains?\nDid your pet have an accident? Find out whether or not you can use bleach to remove pet urine stains on carpet.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nWhen we removed carpet pet urine stains, they were dark in places. Wonder if bleach can be used?\n—Sherry\nAnswer\nHi Sherry,\nDo you know if your carpet is a synthetic (nylon, olefin/polypropylene, polyester) or if it is wool? If it is wool, call a carpet cleaning service sooner than later so they can properly treat the stain. Depending on the age of the carpet and how long it’s been since it’s been cleaned, you may need to have the entire room cleaned so you don’t end up with a very clean section where the stain was pretreated and cleaned.\nIf your carpet is a synthetic, there are lots of different products you can try (I wonder what you have used so far?). Before our very old lab passed on, I found\nClorox® Urine Remover\nto be very effective at getting rid of her urine accidents on not just carpet, but also hard surfaces. With carpet it gets sprayed on, saturating the stain, and then after 3 minutes you use a clean DAMP absorbent towel to blot the stained area to rinse it. Never soak a carpet with water — it’s bad for the subfloor.\nFinally blot the treated area dry with a clean dry towel until no more moisture gets onto the towel. You may need to apply pressure with colorfast heavy objects (books are good as long as they won’t bleed color onto the towel and through to the carpet) to get it all.\nI wouldn’t use\nClorox® Disinfecting Bleach\n. You absolutely can’t if the carpet is made of wool, and synthetic carpet manufacturers typically recommend against it as well.\nI also wonder if you ended up with the dark stains immediately after trying to remove the urine stains or if they appeared over time. If they showed up a little later, then there was probably some product residue left over from whatever you used to originally treat the stain. The residue usually includes the cleaning agents, which then act as dirt magnets and actually attract dirt! If that’s the case, you may want to rent a carpet cleaning machine to really deep clean not just the stained area but the entire room so you don’t end up with a super clean spot.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}