{
    "url": "https://www.clorox.com/learn/flu-prevention-tips/",
    "title": "Fight the Spread of Cold and Flu With These Prevention Tips  &nbsp; | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nFight the Spread of Cold & Flu With These Prevention Tips\nHere are some cleaning and disinfecting tips to help prevent the spread of cold and flu viruses.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nAre you prepared for the next cold and flu season? It’s no question that common colds and the flu can stop families in their tracks, leading to sick days and missed school or work. Each year, adults in the U.S. get an average of two to four colds\n1\n, and around 8% of the U.S. population gets sick from the flu each season\n2\n.\nEstablishing healthy habits can enable you and your loved ones to help prevent the spread of illness-causing germs year-round.\nFirst, it is important to understand how viruses spread. Viruses can spread directly from person to person when someone sick coughs, sneezes and talks or indirectly via surfaces, like when an individual touches a contaminated surface then touches their own mouth, nose or eyes.\nYou can be contagious without symptoms.\nIt is possible for some otherwise healthy adults to infect others beginning 1 day before symptoms develop and up to 5 to 7 days after becoming sick\n3\n.\nViruses can survive on hard surfaces.\nFlu viruses can live on surfaces for up to 48 hours. People can get the flu by touching a surface or object that has the flu virus on it and then touching their own mouth, nose or their eyes\n3\n.\nThe health complications can be severe.\nComplications of flu can include bacterial pneumonia, ear infections, sinus infections and worsening of chronic medical conditions, such as congestive heart failure, asthma, or diabetes.\n2\nLuckily, there are a few simple things you can do to help prevent the spread of viruses and minimize the impact of illness-causing germs on you and your family.\nSmart ways to outsmart germs.\nMaintain your immune system.\nProper diet, hydration, exercise and sleep are all key to maintaining good health. While a strong immune system doesn’t prevent you from getting sick or passing a virus on to others, establishing these habits are beneficial to help maintain your physical health during cold and flu season.\nGet vaccinated.\nAccording to the CDC, a flu shot is the most effective way to help prevent spread of the flu virus. Talk to your doctor, or find a local vaccination center\nhere\n.\nFor COVID-19 related vaccine information, visit\nCenters for Disease Control and Prevention\n.\nDevelop good hygiene habits.\nYou should practice good hygiene year-round, but you can also adopt new habits to help prevent the spread of germs:\nWash your hands.\nYou should wash frequently with water and soap for at least 20 seconds.\nAvoid touching your face.\nTry not to touch your eyes, mouth or nose with unwashed hands.\nCough into your elbow.\nBe sure to practice this healthy habit to avoid germy hands.\nDisinfect high-touch surfaces.\nIt’s important to know how to disinfect common high-touch surfaces and items. For hard, nonporous, high-touch objects like doorknobs, window latches, light switches, tabletops, countertops, bathroom sink, kitchen sink, toilets and faucet handles, we recommend\nClorox® Disinfecting Wipes\n. When used a directed, these disinfecting wipes kill 99.9% of germs that can live on hard, nonporous surfaces, including Cold & Flu Viruses, Respiratory Syncytial Virus (RSV), Rotavirus and SARS-CoV-2, the virus that causes COVID-19.\nLearn\nthe difference between cleaning, disinfecting and sanitizing\nand why it matters. There are a few key differences between cleaning, sanitizing and disinfecting and when each method should be used.\nCleaning removes dust, debris and dirt from a surface by washing, scrubbing or rinsing; this method should be used to keep the home generally tidy and to remove dirt and crumbs.\nSanitizing reduces the bacteria identified on the product’s label on hard, nonporous and soft, porous surfaces and in laundry.\nDisinfecting destroys or inactivates both the bacteria and viruses identified on the product’s label — like influenza and rhinovirus — on hard, nonporous surfaces.\nRelated products\nClorox®\nDisinfecting Wipes₁\nLearn more\nClorox®\nDisinfecting Wipes₃ On the Go - 9 count\nLearn more\nFollow health guidelines.\nHealth guidelines can help us all to prevent the spread of germs. Always avoid close contact with people who are sick, and observe the most up-to-date\nCDC recommendations\nfor mask usage and social distancing as well as local guidelines when you’re out in public.\nDisinfect after an illness.\nIf someone in your household has just recovered from an illness like the flu, it’s a good idea to disinfect surfaces and objects they may have touched. Here’s a comprehensive guide to\ndisinfecting your home after the flu\n.\n*\nHuman Coronavirus, Influenza A2 Virus\n†\nKills SARS-CoV-2 on hard, nonporous surfaces. Use as directed.\n1.\nSource: Facts About the Common Cold. American Lung Association, 27 March 2023,\nhttps://www.lung.org/lung-health-diseases/lung-disease-lookup/facts-about-the-common-cold\n2.\nSource: Clinical Infectious Diseases, Volume 66, Issue 10, 15 May 2018\nhttps://academic.oup.com/cid/article/66/10/1511/4682599\n3.\nSource: Key Facts about Influenza (Flu). Centers for Disease Control and Prevention, 26 Aug. 2021,\nhttps://www.cdc.gov/flu/about/keyfacts.htm\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}