{
    "url": "https://www.clorox.com/learn/how-to-clean-inflatable-pool-floats/",
    "title": "How to Clean Inflatable Pool Floats | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Clean Inflatable Pool Floats\nInflatable pool toys are fun but require cleaning from time to time. Learn how to clean blow-up pool floats and toys so you can get them back in the pool.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nIs it safe to sanitize plastic blow-up pool toys with\nClorox® Disinfecting Bleach\n?\nAnswer\nHappy 4\nth\nof July! I hope everyone has a relaxing and fun-filled holiday. One common 4\nth\nof July activity is a trip to the pool, but between the trek through the bathrooms to the time spent in the baby pool, blow-up pool toys can collect plenty of germs! Fortunately, blow-up pool toys that are made of vinyl or plastic can be sanitized with a solution of 2 teaspoons\nClorox® Disinfecting Bleach\nper gallon of water.  Wipe the bleach solution on, let stand 2 minutes, and then allow items to air dry (you don’t have to rinse them, similar to sanitizing food contact surfaces).  It will probably be easiest to do this when the toys are inflated.  Also, plan ahead and think about where you will be doing the washing and rinsing—if you will be doing this outdoors, you might want to get a large tarp to work on and use it to air dry the items on. Once you are finished just hose it off.  If the toys aren’t that big, you could also do this inside in your shower, taking care to close the door or curtain so the bleach solution doesn’t splash onto other items in your bathroom, and leave the items in the shower to air dry.\nNote that if you are using the pool toys in a lake or reservoir with murky water, you may want to use a stronger solution to disinfect the toys: add ⅓ cup\nClorox® Disinfecting Bleach\nto 1 gallon of water and apply the solution to the toys for 6 minutes, then rinse thoroughly and allow to air dry.  For this stronger solution, if you will be working outside, water any nearby plants first to protect them from runoff.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}