{
    "url": "https://www.clorox.com/learn/how-to-clean-terracotta-clay-and-other-flower-pots-with-bleach/",
    "title": "How to Clean Terracotta Clay and Flower Pots with Bleach | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Clean Terracotta Clay and Other Flower Pots with Bleach\nYou might be surprised to learn that bleach can help maintain healthy plants and flowers. Here’s how to clean your flower pots to help prevent the spread of mold and diseases between plants.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nBefore planting, clean flower pots with bleach.\nFor your indoor or outdoor gardening, before you plant new seeds or plants, you can help prevent the transfer of mold and diseases from old plants to new ones when you treat your old flower pots and planters with a bleach and water solution made with\nClorox® Disinfecting Bleach\n. This solution is appropriate for a wide variety of gardening containers such as terracotta, clay, plastic and ceramic pots.\nGather your supplies\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nPowdered detergent\nPlastic bucket\nMeasuring spoons\nLarge plastic spoon\nMeasuring cup\nProtective gloves\nSafety glasses\nNylon scrub brush\nSponge\nSteps to clean a flower pot with bleach\nMix prewash solution\nIn a plastic bucket, add a tablespoon of powdered laundry detergent to 1 gallon of hot tap water and stir to dissolve with the large plastic spoon.\nPre-wash each flower pot\nUse the prewash solution and a nylon brush to scrub each flower pot on both the inside and the outside to remove any organic matter, then rinse thoroughly with clean water and set aside.\nMix the bleach and water solution\nFill a second plastic bucket with 1 gallon of cool water, then add 1/3 cup\nClorox® Disinfecting Bleach\nor 1-1/2 cups\nClorox® Outdoor Bleach\n.\nSoak the flower pot\nSubmerge the flower pot in the bleach and water solution and let it soak for 6 minutes.\nTip\nLarger flower pots that don’t fit in a bucket can be sponged with the bleach solution, reapplying it as needed to keep the pot wet for the full 6 minutes.\nRinse\nThoroughly rinse the flower pot with clean water.\nTip\nWhen finished, the bleach and water solution can be easily disposed of by pouring it down any sink drain.\nAir dry\nAllow flower pots to air dry completely before planting.\nFrequently Asked Questions\nCan I use a bleach and water solution to wash the fabric that lines a hanging basket?\nYes, geotextiles are typically bleach-safe, but if you aren’t sure\ntest a hidden area\nfirst. For colorfast geotextiles, first shake out loose soil and debris, then hand wash the fabric in a little detergent and water. Rinse thoroughly, then submerge in the bleach and water solution and allow to soak for 6 minutes. Rinse again and allow to air dry before planting.\nHow long does a bleach and water solution last?\nBleach and water solutions need to be made fresh each day that you use them because the bleach active, combined with your tap water, breaks down quickly into salt and water. Ready-to-use products, on the other hand, are formulated with a one-year shelf life when properly stored away from direct sunlight in a cool, dry place.\nWhat’s the best way to dispose of a bleach and water solution?\nThe bleach and water solution can be easily disposed of by pouring it down any sink drain.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}