{
    "url": "https://www.clorox.com/learn/how-to-clean-high-chair/",
    "title": "How to Clean and Sanitize a High Chair  | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Clean and Sanitize a High Chair\nIt’s easy to clean and sanitize your baby’s high chair, with or without bleach. For a bleach-free solution, use our Free & Clear line of products that’s safe around kids, food and pets!*\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nIt’s easier than you might think to safely clean and sanitize high chair surfaces. While disinfecting bleach is always a great option, our bleach-free Clorox® Free & Clear product line is safe to use around kids, food and pets.* And it kills 99.9% of bacteria and viruses when used as directed, making it a great disinfecting option for high chairs and other baby items.\nRelated Articles\nHow to Clean and Disinfect Baby Toys With or Without Bleach\nHow to Clean a Baby Changing Table\nCleaning with bleach\nWhat you need\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nDish detergent\nPlastic dishpan\nMeasuring cup\nMeasuring spoons\nSponge\nSteps to sanitize a high chair with bleach\nPre-clean the high chair tray\nRemove the tray from the chair and use the sponge and the dish detergent to wash it with hot soapy water, then rinse with clean water. Set the tray aside, and then rinse the sponge and set it with the tray.\nTip\nWipe down the rest of the chair with the sponge to remove obvious food at the same time you clean the tray.\nMake the bleach sanitizing solution\nMeasure 1 gallon of water (16 cups) into the plastic dishpan, then add 2 teaspoons\nClorox® Disinfecting Bleach\n.\nTip\nBleach and water solutions used for sanitizing must be made fresh daily.\nSanitize the high chair\nUse the sponge to wipe the high chair tray and the high chair with the bleach and water solution, reapplying as needed so the surfaces stay wet.\nTip\nTo sanitize, surfaces must stay wet for 2 minutes.\nAir dry\nThere is no rinsing step when sanitizing food-contact surfaces, including high chairs. Just let the tray and the chair air dry before use.\nCleaning with Free & Clear\nWhat you need\nClorox®\nFree & Clear Disinfecting Mist\nLearn more\nClorox®\nFree & Clear Multi-Surface Spray Cleaner\nLearn more\nClorox®\nFree & Clear Compostable* Cleaning Wipes\nLearn more\nPaper towels\nSteps to clean and sanitize a high chair with Free & Clear\nPre-clean the high chair\nHold Clorox® Free & Clear Multi-Surface Spray Cleaner 6-8 inches from the surface and spray onto the high chair, then wipe clean with a paper towel. Or you can wipe the high chair clean with Clorox® Free & Clear Compostable Cleaning Wipes.\nSanitize the high chair\nHold Clorox® Free & Clear Disinfecting Mist 6-8 inches away from the surface and spray the high chair until thoroughly wet.\nTip\nSurface must remain visibly wet for 1 minute to sanitize, or 2 minutes to disinfect.\nAllow to dry\nTreated surfaces will air dry in a few minutes, or they can be wiped dry with a paper towel.\n*\nWhen used as directed.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}