{
    "url": "https://www.clorox.com/learn/how-to-sanitize-dishes-with-bleach/",
    "title": "How to Sanitize Dishes and Lunchboxes with Bleach | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Wash and Sanitize Dishes with Bleach\nWashing dishes can eliminate visible dirt, but it’s not enough to kill bacteria like salmonella. To sanitize dishes and food containers, rinse them with a bleach and water solution after washing.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nGerms and viruses can survive for hours on hard surfaces, so it’s a good idea to give items like dishes and food containers an occasional sanitizing treatment to reduce germy dirt. This is especially true if someone in your household has just recovered from a cold, flu or other virus.\nBacteria on food-adjacent surfaces\nIn addition to common cold and flu viruses, dangerous bacteria on food-adjacent surfaces can also cause food poisoning. It’s not just a problem for dishes and glassware. Lunchboxes, plastic food containers, water bottles and even stainless steel reusable straws can be affected. Fortunately, it’s also easy to fix. All you have to do is sanitize your dishes in a bleach solution after washing and rinsing them.\nJust use this table to determine how much bleach you’ll need to make your sanitizing solution.\nContainer\nAmount of Water\nAmount of Bleach\nLarge sink\n3 gallons\n2 tablespoons\nLarge dishpan\n2 gallons\n1 tbsp + 1 tsp\nSmall dishpan\n1 gallon\n2 teaspoons\n32 oz. water bottle\nFill with water\n½ teaspoon\n24 oz. coffee tumbler\nFill with water\n¼ + ⅛ tsp\n16 oz. water bottle\nFill with water\n¼ teaspoon\nRelated Articles\nBleach Dilution Ratio Chart for Disinfecting\nHow to Disinfect Your Home After a Cold or Flu\nWhat you need\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nDish detergent\n1 quart measuring cup\nMeasuring spoons\nPlastic dishpans\nDish drying rack\nSteps for sanitizing dishes\nWash thoroughly\nFill a sink or dishpan with hot soapy water, and wash your dishes. As you work, transfer the washed dishes to clean water in a second dishpan or the other half of your sink.\nTip\nDon’t wash non-stainless steel, aluminum, silver or chipped enamel with bleach. Disinfect these by scalding.\nRinse completely\nDrop the soapy dishes into the rinse water. They can stay there while you mix up the bleach and water solution.\nPrepare the bleach and water solution\nRefer to the guidelines above to determine the ratio of bleach to water you’ll need for your sanitizing solution. Use cool water along with a third dishpan or clean sink to mix your solution.\nSanitize the dishes\nSubmerge the dishes in the bleach and water solution, allowing them to soak for 2 minutes.\nLet the dishes drip or air dry\nRemove the dishes from the sanitizing solution and transfer them to the drying rack to air dry. No rinsing is required after sanitizing.\nFrequently Asked Questions\nCan you wash dishes with bleach?\nYou can wash dishes as usual, then rinse them using a diluted Clorox® Disinfecting bleach solution to sanitize.\nDo I need to use tap water for sanitizing dishes?\nYes, only use potable water. This application is not the same as what we recommend to make water safe to drink in an emergency.\nWhy can’t I just add the bleach to the sudsy water?\nThe washing, rinsing and sanitizing steps must all be done separately. That’s because bleach breaks down very quickly in the presence of organic matter. So the organics coming off your dishes would very quickly degrade the bleach if they were together in the same solution, and you would no longer have the correct concentration of bleach to kill the bacteria.\nCan I use Splash-less® Bleach to sanitize dishes?\nNo — even though\nClorox® Splash-Less® Bleach\nis now EPA-registered, sanitizing dishes and other food-contact surfaces is not an approved use on the EPA registration.\nCan I put bleach in my dishwasher with my dishes?\nRegular bleach is not intended for use by itself in a household dishwasher. Instead, look for Automatic Dishwashing Detergents that already contain bleach. Commercial dishwashers (like what you’d see in a restaurant or other institution) do allow for bleach use depending on the model. Check the instruction manual or ask a service technician for guidance on proper use.\nI bought my bleach at a warehouse store and it has a different name. Can I use it instead?\nYes. Depending on where you buy your bleach, you could also use any of the following: Clorox® Bleach\n1\n, Clorox® Regular Bleach\n3\n, Clorox® Performance Bleach\n2\nand Clorox® Germicidal Bleach\n4\n.\nHow can I check to see that my bleach solution is strong enough?\nUse a chlorine test strip to confirm you have the correct concentration of sanitizing solution, 185ppm available chlorine. If the level is too low, carefully add a small amount of bleach and re-test with a fresh test strip.\nIf you’re sanitizing a large number of items, periodically re-test the sanitizing solution to make sure you maintain the correct level of bleach active. If necessary, add a small amount of bleach when needed when the bleach active level falls below 185ppm.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}