{
    "url": "https://www.clorox.com/learn/how-to-remove-urine-stains-pet-hair-from-hardwood-floors/",
    "title": "How to Remove Urine Stains and Pet Hair from Floors | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Remove Urine Stains and Pet Hair from Hardwood Floors\nLearn how to remove pet stains and pet hair from wood floors including how to remove dog and cat pee, dog and cat hair, and urine smells from hardwood floors.\nMore from Clorox experts\nTransform your home with long-lasting scents.\nUse as directed.\nCleaning pet stains on hardwood floors\nWhen pets cohabitate with hardwood floors, some sticky (and stinky) situations may develop, such as when your beloved pet leaves you a not-so-special surprise, or when “look what the cat dragged in” takes on an unfortunate literal meaning.\nHowever, maintaining hardwood floors in a house with pets is possible if you know how to remove pet stains from hardwood floors. Removing pet stains to maintain hardwood floors is easy if you’re equipped with the right tools, cleaning products, and tips.\nRead on to learn how to remove pet stains from hardwood floors, and how to protect your hardwood floors from your beloved furry friends.\nTools to clean pet stains from hardwood floors\nThe first step in cleaning and addressing pet stains on hardwood floors is to gather your supplies.\nFor a convenient way to clean pet stains on hardwood floors, you’ll need:\nClorox® Scentiva® Disinfecting Wet Mopping Cloths\n1\nin your favorite scent\nSwiffer® Sweeper\n2\nor another standard mopping tool\nAnother option to get rid of pet stains is to use a wet mop and hardwood floor cleaner. For this option, you’ll need:\nFloor cleaner safe for hardwood floors\nHands-free wringing mop or another mop of your preference\nBucket\nClean towel\nGloves (if your hands are sensitive to cleaners or if required by use instructions)\nFor a quick and convenient solution, use Clorox® Scentiva® Disinfecting Wet Mopping Cloths to clean pet stains, including pet hair and dander. The cloths are pre-saturated with cleaner and fit Swiffer® Sweeper\n2\nand other standard mop heads. They’re ultra-textured to trap 4x more particles\n3\n, dirt and pet hair, kill 99.9% of germs\n4\n, and are safe to use on sealed or finished hardwood floors.\nThese floor wipes will also freshen your room with uplifting long-lasting scents without harsh chemical smells. Clorox® Scentiva® Disinfecting Wet Mopping Cloths come in three elevated scents:\nLavender & Jasmine: Lavish yet delicate balance of lavender and blossomed jasmine petals\nCoconut & Waterlily: Vibrant, enticing scent of freshly shaved coconut carried on a warm ocean breeze\nGrapefruit & Orange Blossom: Elegant blend of florals with layers of lush fruity notes\nFor information on indulging your home beyond your floors, check out additional\nClorox® Scentiva® products\n.\nYou can also use Clorox® Bleach to clean and disinfect hardwood floors following a pet mess. However, bleach should never be used full-strength. Always dilute it in water and follow the instructions on the bottle. Learn more about\nusing bleach on hardwood floors\n.\nEnzymatic floor cleaners are another option for cleaning pet stains, including urine stains, on hardwood floors. These cleaners break down stains and odors caused by pet urine. Enzymes in these cleaners neutralize urine and make cleanup, stain removal and odor elimination easier. Learn more about how to remove pet stains from hardwood floors with other pet stain removing products like\nClorox® Pet Urine Remover\n.\nSteps for cleaning, mopping and removing pet stains\nWhenever you spot a pet mess such as pet urine, try to soak up as much of the liquid as possible as quickly as possible with an absorbent cloth or dry paper towel. If a liquid like urine soaks in between the floorboards, it can cause damage and odor.\nIf you’re going for convenience to clean pet stains, grab your standard mopping tool and Clorox® Scentiva® Disinfecting Wet Mopping Cloths and follow these three easy steps:\nAttach\nAttach wet mopping cloth to sweeper head.\nMop\nMop the hardwood floor. Make sure to use enough cloths so the floor is visibly wet for 10 seconds to sanitize. If you want to disinfect your hardwood floors or do a deeper pet mess cleaning, make sure floors remain wet for 4 minutes.\nLet air dry.\nNo rinsing required.\nBleach is an option to remove pet stains from floors. If you’re using bleach, follow our EPA-registered protocol to kill germs and bacteria, and follow the steps below:\nMix\nMix up a disinfecting solution of 1/2 cup Clorox® Bleach and 1 gallon water; to kill canine parvovirus, use 1/2 cup Clorox® Bleach and 3/4 gallon water.\nPrewash\nPrewash the area and then mop or wipe with the disinfecting solution.\nLet stand\nLet stand for 10 minutes.\nRinse\nRinse thoroughly and air dry.\nRead more\nfloor cleaning tips\nand how to\nmop wood floors with bleach\n.\nBest practices for cleaning pet stains from hardwood floors\nIt’s best to regularly clean your floors to keep then free of pet hair and other pet stains. For quick daily cleanings keep a vacuum, soft broom, dust mop or microfiber mop on hand to run over floors to pick up any pet hair or loose particles. We know how those sweet and unintentionally sneaky pets are notorious for bringing in all kinds of debris.\nWhen removing pet stains, consider cleaning hardwood floors in small sections to be sure you can manage rinsing quickly and thoroughly. Also, be sure the room is well-ventilated — for your sake and your pet’s. And it’s a good idea to wear eye protection and gloves when working with a bleach solution to remove more challenging pet stains.\nFor whatever pet stain remover cleaning product you end up using, it’s best to learn how to best remove pet stains from hardwood floors. Always test a small section of the floor before cleaning the whole pet mess and read the directions on how to use stain removing cleaning products.\nRemoving pet stains: Natural cleaning options\nIf you prefer natural products for cleaning pet stains, consider using white vinegar. White vinegar works to neutralize the ammonia in urine, and it’s also a deodorizer.\nThe typical recommended mixture contains 1/4 cup vinegar to 1 gallon of warm water. You can use this mixture on many others surfaces throughout your home in addition to hardwood floors—even for messes your pet didn’t make.\nTo use a vinegar mixture on your hardwood floor, follow the same steps for regular mopping or mopping with bleach.\nOne last trick to remove pet stains from hardwood floors is to use baking soda to absorb liquids, including urine. Baking soda also helps to neutralize odors. Sprinkle baking soda on the damp area, allow enough time for the soda to absorb the moisture, and then wipe up with a towel or paper towel.\nClean floors for your pet and you\nIf you can make cleaning and disinfecting your hardwood floors part of your regular cleaning routine, then you can more easily stay ahead of the trail of messes and pet stains that your pet leaves behind. You’ll ensure that your floors and your home are clean for you, your pets, and your family.\nRelated products\nClorox® Scentiva®\nDisinfecting Wet Mopping Cloths\nLearn more\nClorox®\nUrine Remover\nLearn more\n1\nClorox® Scentiva® Disinfecting Wet Mopping Cloths are not for use on unpainted wood and unfinished, unsealed, unpainted, waxed, oiled or worn surfaces. Test a small area first.\n2\nSwiffer® is a registered trademark of The Procter & Gamble Company.\n3\nvs. Clorox® Disinfecting Wipes.\n4\nWhen used as directed on hard, nonporous surfaces.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}