{
    "url": "https://www.clorox.com/learn/how-to-clean-glass-shower-doors-with-bleach/",
    "title": "How to Clean Glass Shower Doors With Bleach | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Clean Glass Shower Doors With Bleach\nThe same bleach and water solution you use to clean ceramic tile in your shower can also clean glass shower doors. Sponge it on to remove mold and mildew stains and prevent future soap scum stains.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nWhen it’s time to clean glass shower doors,\nClorox® Disinfecting Bleach\nmakes it easy. Just mix up our bleach and water solution, spray it on, wait a few minutes, then rinse it off. Not only does this solution remove mold and mildew from glass doors and other hard, nonporous surfaces in your shower, it also protects them from future stains like soap scum.\nRelated Articles\nHow to Disinfect and Clean a Bathtub or Shower with Bleach\nBleach Dilution Ratio Chart for Disinfecting\nDon't ignore soap scum\nCleaning mold sometimes means cleaning soap scum first\nIf your glass shower doors have mold and mildew stains AND soap scum, treat the soap scum first with\nClorox® Disinfecting Bathroom Cleaner\n. Just spray it on, wait a few minutes, then rinse to break up the soap scum and make it easier for the bleach to take care of the mold and mildew. Added bonus: cleaning with\nClorox® Disinfecting Bleach\nrepels future mold stains and soap scum, too.\nRelated products\nClorox®\nDisinfecting Bathroom Cleaner\nLearn more\nWhat you need\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nProtective gloves\nMeasuring cup\n32 ounce plastic spray bottle\nScrubber sponge\nSteps to clean glass shower doors\nPrepare the area\nOpen a window to allow good air circulation. Set aside any non-slip mats, as well as personal care products such as shampoo bottles, soap and razors.\nMix the bleach and water solution\nFill the spray bottle with 4 cups of water, then add 4 teaspoons Clorox® Disinfecting Bleach. Wear protective gloves and clothing you don’t mind accidentally contacting the bleach solution.\nNever use bleach at full strength on any surface. It should always be diluted with water first.\nSpray the solution onto the shower doors\nStarting at the top, spray the solution onto each door, working your way down as you go. Re-spray as needed to keep the doors wet for 6 minutes, scrubbing with the sponge if needed to remove tough stains.\nTip\nFor severe mold and mildew, allow the solution to stay on the surface for 10 minutes before rinsing.\nRinse with water and air dry\nUse the shower head to rinse the doors. For any areas the water doesn’t reach, you can empty the spray bottle and fill it with clean water and spray down any remaining areas still needing a rinse. Once the area is dry, replace the items removed prior to cleaning.\nTip\nBleach and water solutions should be made fresh daily.\nFrequently Asked Questions\nWhat surfaces are safe for a bleach and water solution?\nIn addition to glass, you can also use\nClorox® Disinfecting Bleach\non stainless steel, sealed granite, glazed ceramic tile, painted wood and many other hard, nonporous surfaces. Do not use on marble, non-stainless steel, aluminum, silver or chipped enamel.\nCan you use bleach at full strength?\nNo, bleach must always be diluted with water first. When diluted with water as directed, bleach can be safely used on a variety of hard, nonporous surfaces.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}