{
    "url": "https://www.clorox.com/learn/how-to-do-laundry-wash-clothes/",
    "title": "How to Do Laundry and Wash Clothes | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Do Laundry and Wash Clothes\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nTips on How to Do Laundry\nBefore you fire up your machine, take a moment to get your laundry ducks in a row.\nThe Staples\nFor laundry success, you’ll need the right tools:\nDry detergents can be more effective than liquid detergents.\nClorox® Disinfecting Bleach\nis a stain-fighting boost to your detergent for white, bleach-friendly fabrics.\nClorox 2® for Colors Stain Remover and Laundry Additive\nremoves stains and brightens colors when added to your detergent.\nTopical soil and stain removers, available in pen, wipe and spray forms, are applied exactly where you need them.\nFabric softeners make fabric feel softer and reduce static. They are available in liquid and dryer-sheet forms.\nSorting Suggestions\nThe main ingredient in any laundry recipe is the laundry. Whites, light colors and darks: Most of us have learned to separate our laundry into these three piles.\nHere are some less obvious but equally helpful sorting tips, in case your piles are still mountainous:\nSeparate lint producers (towels & blankets) from lint magnets (corduroy & fleece).\nNatural fibers from synthetic fibers, because they dry at different rates.\nTough fabrics (jeans) from delicate fabrics (lace camisole).\nKeep lingerie and hosiery in a mesh bag — straps and stockings won’t tangle up in the washer.\nWash garments with bright colors on white (for example: red-and-white-striped shirt) separately for the first wash. If the dye runs, it only ruins one garment. Then you can call it a design element.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}