{
    "url": "https://www.clorox.com/learn/how-to-get-stains-out-of-carpet/",
    "title": "How to Get Stains Out of Carpet | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Get Stains Out of Carpet\nGot carpet stains? See our carpet cleaning and carpet stain remover tips to learn how to remove stains from carpet including coffee, red, pee, and old stains.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nHELP! I caught my youngest son spitting red Gatorade at his brother in our living room the other day. This room has multi toned brown to beige carpeting and we keep it very dark in there. Since I was extremely sick I didn’t even notice that he had actually been spitting AND squirting the entire bottle all over. Two days later I’m giving the house a deep cleaning because my landlord is coming over tomorrow to work on the house and I find this! Red/pink stains EVERYWHERE!! Do you think that I could use the Clorox Color Safe Bleach on it? I’ve tried hydrogen peroxide and a stain remover and nothing is working! PLEASE HELP!\nAnswer\nThis is a very unfortunate situation. It’s pretty much impossible for a mom of small kids to take a “sick day” without everything falling apart.  As far as using Clorox 2® for Colors, while it does work very well taking out Gatorade stains on fabric, the formula is a little too thick to use as a pretreatment product on carpet.  The biggest issue is that it will be very difficult to completely rinse away, especially if you are trying to remove the stains without any special equipment.  You mentioned that the two things you tried didn’t work–something else that should help is more powerful mechanical action, which for carpet means renting a steam carpet cleaner from your local hardware store.  Because the stains are everywhere, you might as well just clean the entire room, so get both a general carpet cleaning product appropriate for the machine (they should have something available with the carpet rental) and a pretreatment stain remover.\nIf you would prefer a product specific for carpet, than you may want to try Formula 409® Carpet Spot and Stain Remover, which you can learn more about\nhere\n.\nI also wanted to mention that whether you use this product or something else, it’s always a good idea to test your carpet for colorfastness on a part of the carpet that is hidden or less visible (think under a sofa).  I would expect that most synthetic carpets would be perfectly fine for a wide variety of products, but not wool.  Since you are renting, you probably don’t’ know what type of carpet you have, so all the more reason to test first.\nI’m not sure how old your kids are, but since kids grow up (way too) fast, I can tell you that before you know it they will be old enough to bring you tea and make you soup, and leave you alone without destroying the house, and allow you to get some rest, so hang in there!  I hope this helps—good luck, and please let me know how it goes!\n–Dr. Laundry\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}