{
    "url": "https://www.clorox.com/learn/does-bleach-kill-ringworm-fabric-surfaces/",
    "title": "Does Bleach Kill Ringworm on Fabric and Surfaces? | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nDoes Bleach Kill Ringworm on Fabric and Surfaces?\nHad a ringworm infestation? Find out if bleach kills ringworm and how to wash clothes with ringworm so you can disinfect your house as soon as possible.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nHow do I treat laundry after a ring worm infestation?\nAnswer\nThat’s too bad about the ringworm!  To disinfect white or safely bleachable colored laundry, wash in the hottest water recommended on the care label using detergent and 3/4 cup\nClorox® Disinfecting Bleach\n. For extra-large or heavily soiled laundry, use up to 1 ¼ cups.  Note that you should avoid bleaching wool, silk, mohair, spandex, and leather.\nUnfortunately there is no product to disinfect any and all colored laundry. For any product to make this claim it must have an EPA registration which is obtained by successfully completing required tests to demonstrate efficacy. It’s good to know there are definitely some colored fabrics than can be safely bleached with\nClorox® Disinfecting Bleach\n, and this primarily depends on which type of dye was used to color the fabric. You can easily test bleachability as follows:\nMix a test solution by diluting 2 tsp\nClorox® Disinfecting Bleach\nin ¼ cup water.\nApply a drop to a hidden part of the item such as an inside hem, cuff, or seam and then blot dry.\nNo color change means the item can be safely bleached.\nI have had success safely bleaching many different colored items: light colored linens and towels, cotton boxer shorts, and 100% polyester fleece, just to name a few.  Assuming your items pass, you can wash them in the hottest water recommended on the care label using detergent and ¾ cup\nClorox® Disinfecting Bleach\nas directed above. For items that don’t pass the bleachability test, you can try the following techniques to at least reduce the germ count.\nWash in the hottest water recommended on the item’s care label\nWash any items of particular concern separately from other items to avoid germ transfer, and consider washing them twice\nUse the hottest dryer setting recommended on the care label, and dry items separately from other loads; or at least with some white towels so the underwear tumbles properly in the dryer.\nFinally, consider following up with a washer clean-out cycle with ¾ cup\nClorox® Disinfecting Bleach\nto be sure the clothes washer is disinfected and germs don’t transfer to other loads. In fact, clothes washer manufacturers recommend doing this!\nDoes anyone else need disinfecting advice?\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}