{
    "url": "https://www.clorox.com/learn/what-is-monkeypox-and-virus-transmission/",
    "title": "What Is Mpox (Formerly Monkeypox, How It’s Transmitted and More | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nWhat Is Mpox and How to Help Prevent the Spread\nWith mpox (formerly monkeypox) recently becoming a trending topic in the news and on social media, it is important to learn about the virus and how you can help prevent the spread.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nWhat Is Mpox?\nAccording to the\nCenters for Disease Control and Prevention (CDC)\n, mpox is a zoonotic disease caused by infection with mpox virus, which is part of the same family of viruses as the virus that causes smallpox.\nWhat Are Mpox Symptoms?\nMpox symptoms can include:\nFever\nHeadache\nBody aches\nChills\nExhaustion\nSwollen lymph nodes\nRash that can look like pimples or blisters that appear on the face, inside the mouth and other parts of the body\nMost infected individuals recover within two to four weeks, but there are several practical measures that can be taken to help prevent infection and reduce its spread in your community.\nHow Is Mpox Transmitted?\nAccording to the CDC, the mpox virus is transmitted through close, personal, often skin-to-skin contact. This can include direct contact with mpox lesions, scabs or body fluids from a person already infected with the virus or indirect contact by touching objects, fabric (clothing, bedding or towels) or surfaces that have been used by someone with mpox. Therefore, the CDC and health experts recommend that people avoid close contact with anyone who may be infected with mpox.\nHelping to Prevent the Spread of Mpox\nAvoid Contact with Infected Individuals: To help protect yourself against person-to-person transmission, avoid close, skin-to-skin contact with individuals who are infected with the mpox virus or who have a rash that looks like mpox.\nAvoid Contact with Contaminated Items: Avoid contact with objects and materials that a person with mpox has used. Do not share eating utensils or cups with a person with mpox, and do not handle or touch the bedding, towels or clothing of a person with mpox.\nHand Hygiene: It's always important to practice good hand hygiene by washing your hands with soap and water or using an alcohol-based hand sanitizer.\nIf You’re Feeling Sick: Most importantly, if a new and unexplained rash appears (with or without chills and fever), avoid contact with other people. Call ahead before seeking medical attention; or, if unable to call, tell staff upon arrival of any concerns about mpox.\nCaring for Someone Infected with Mpox\nIndividuals who have mpox, and do not require hospitalization, are recommended by the\nCDC\nto isolate at home for the duration of the illness. If you’re caring for someone with mpox, they should isolate from others and anyone helping to care for them should use personal protective equipment like a mask and gloves when handling contaminated items like bedding or towels.\nAccording to the CDC, disinfection of surfaces is recommended for all areas (such as in the home and vehicle) where a person with mpox has been or is currently spending time as well as sanitizing any used linens, towels and clothing. The Environmental Protection Agency (EPA) has activated its Emerging Pathogen Policy for mpox to support environmental hard surface disinfection. This means that product manufacturers can make off-label claims about a disinfectant’s effectiveness against mpox. Multiple Clorox disinfecting products are eligible for use against the mpox virus, including\nClorox® Disinfecting Wipes\n,\nClorox® Disinfecting Bleach\nand\nClorox® Clean-Up® Cleaner + Bleach\n.\nAlways avoid close contact with people who are sick and observe CDC recommendations as well as local guidelines. Learn more about how to stay healthy and germ-free through\nsanitizing and disinfecting\n.\nRelated products\nClorox®\nDisinfecting Wipes₁\nLearn more\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nClorox®\nClean-Up® Cleaner + Bleach\nLearn more\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}