{
    "url": "https://www.clorox.com/learn/how-to-clean-mirrors-and-faucets-with-wipes/",
    "title": "How to Clean Bathroom Mirrors, Sink Faucets, and Countertops | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Keep Counters, Faucets and Mirrors Disinfected and Clean\nLearn how to disinfect your bathroom counters, faucets and mirrors with disinfecting wipes.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nDisinfecting & Cleaning Counters, Faucets & Mirrors\nIf you’re looking for a convenient way to disinfect your bathroom counters and faucets, all you need is a regular once-over with a wipe. It kills 99.9% of germs and keeps your counters and sinks fresh and clean.\nDisinfect your mirrors by simply wiping down with\nClorox® Disinfecting Wipes\n, then follow up with a DIY solution of vinegar and water to help remove streaks. Mix 1 part vinegar with 1 part water in a spray bottle. Shake, then spray the mixture onto a lint-free cloth and wipe. Repeat as needed.\nTo tackle germy dirt on even larger surfaces, use\nClorox® Disinfecting Bathroom Cleaner\nas directed to keep your bathroom feeling fresh and clean.\nRelated products\nClorox®\nDisinfecting Wipes₁\nLearn more\nClorox®\nDisinfecting Bathroom Cleaner\nLearn more\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}