{
    "url": "https://www.clorox.com/learn/does-bleach-kill-covid-and-viruses-bacteria-germs-on-surfaces/",
    "title": "Does Bleach Kill COVID and Other Viruses and Bacteria? | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nDoes Bleach Kill COVID-19 and Other Viruses, Bacteria and Germs?\nNeed to get rid of COVID on home surfaces? Find out whether or not chlorine bleach kills COVID, flu, strep, and other viruses, bacteria, and germs on surfaces.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nDisinfectants play an important role in helping keep our communities safer from any infection-causing viruses. They’re used to kill germs in our homes and laundry areas, as well as other nonporous surfaces. Disinfectants are an important part of preventing the spread of germs and viruses that live on surfaces.\nRead more on how Clorox® disinfectants are a must-have in your household to help kill and prevent any viruses, as well as the types of germs.\nWhat Viruses Can Clorox® Disinfectants Kill?\nThe Clorox® disinfectant products\nlisted here\ncan kill viruses such as Coronavirus (COVID-19), cold and flu germs, Strep, Staph,\nE. coli\n,\nSalmonella, Listeria and other germs that can be caught on surfaces.\nEach disinfectant kills a different list of germs — make sure to check your product’s label for more information. Find a list of products effective against COVID-19\nhere\n.\nHow Clorox® Disinfecting Products Can Remove and Kill Viruses on Surfaces\nDisinfectants need to back up their claims in order to promote efficacy against a specific virus like the common cold, flu or SARS-CoV-2, the virus that causes COVID-19. Clorox scientists follow strict product efficacy testing requirements established by the EPA for claim verification. This government body evaluates our disinfectant products in a lab under Good Laboratory Practice (GLP) conditions. The criteria tested for efficacy against viruses are:\nProduct Application\nSurface Type\nContact Time\nReproducibility\nConsistency of Results\nDisinfecting destroys or inactivates both the bacteria and viruses identified on the product’s label (like influenza and rhinovirus) on hard, nonporous surfaces. Disinfecting hard, nonporous surfaces is one of the most reliable ways to help lower the risk of spreading germs from surfaces by touch.\n1\nFor a full list of Clorox® Disinfecting products that kill viruses through disinfection, please\nvisit our cleaning and disinfecting products page\n.\n1.\nAccording to Saskia Popescu, PhD, MPH, MA, CIC, a senior hospital infection prevention epidemiologist at HonorHealth and paid Clorox consultant.\nRelated products\nClorox®\nDisinfecting Wipes₁\nLearn more\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}