{
    "url": "https://www.clorox.com/learn/how-to-add-bleach-to-front-load-washer/",
    "title": "How to Add Bleach to a Front Load Washer | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Add Bleach to a Front Load Washer\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nWhat’s the right way to use Clorox bleach in my Frigidaire front-loading washing machine? The dispenser drawer has separate compartments for detergent, bleach and fabric softener. How much bleach should I be using? Are there any other points to remember when adding bleach to my machine?\nAnswer\nThe simple answer for bleach usage in any HE washer is whatever the bleach dispenser capacity happens to be. The only way you can add products to a HE machine is via the built-in dispenser unit and it’s almost impossible to add more without negatively impacting the products in adjacent compartments from the overflow. On the Frigidaire we have in the lab, there is a Min- and Max- level indicator. So, fill the dispenser to the top and that should satisfy your needs.\nWhile you are not adding as much as in a top-loader washer, less water and the fact that the bleach is dispensed a little later in the cycle means this will work for you.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}