{
    "url": "https://www.clorox.com/learn/how-to-disinfect-office-space/",
    "title": "Office Disinfection Tips | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nOffice Disinfection Tips\nWhether you spend your work week in a home office or shared office environment, it’s important to disinfect your daily workspace to help prevent the spread of viruses.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nIt’s never been more important to keep high-touch surfaces clean to help prevent the spread of cold, flu and other viruses. Here’s a quick guide to help you maintain healthy office disinfection and cleanliness habits.\nWipe down hard, nonporous surfaces\nCarefully wipe down your desktop, chair and drawers with\nClorox® Disinfecting Wipes\nor\nDisinfecting Wipes On the Go\n. Let surfaces remain wet for four minutes in order to properly disinfect.\n1\nGive hotspots extra care\nDoor handles, lamps and light switches can be hotspots for germs. Disinfecting wipes make it easy to tackle those high-touch areas throughout the day.\nHit your high-touch devices\nThere’s a good chance your trusty computer keyboard and mouse setup are ready for a thorough\nClorox® Disinfecting Wipes\nwipedown. You’ll also want to hit any remote controls and desk phones, and read our quick how-to guide for\ncleaning your phone screen and case\n.*\nTip\nAlways follow manufacturer instructions for cleaning and disinfecting electronics, and use cleaners only as directed.\nBe a team player\nIf you work in a shared workspace, it’s important to maintain healthy habits in the office, at home,\neven on your commute\n. Follow your company’s guidelines for vaccination and social distancing in the workplace, and\nregularly wash your hands\nwith soap and water or use alcohol-based hand sanitizer.\n2\nFrequently Asked Questions\nHow should I clean the keyboard for my computer or laptop?\nAlways follow manufacturer instructions for cleaning and disinfecting electronics. First, turn your laptop or computer off and if possible, remove your laptop’s battery. If cleaning a computer keyboard, unplug the keyboard from its power source. As always, be sure to check the manufacturer’s instructions before proceeding.\nWring the excess liquid from a\nClorox® Disinfecting Wipe\n, then carefully wipe down all sides of your keyboard and cord, making sure that cleaning solution doesn’t seep into the seams of the casing or in between keys. Let surfaces remain wet for four minutes in order to properly disinfect.\nHow should I sanitize soft surfaces in my workplace?\nBleach-free\nClorox® Disinfecting Mist\nlets you sanitize soft surfaces and deodorize, no wipe required.\nRelated products\nClorox®\nDisinfecting Wipes₁\nLearn more\nClorox®\nDisinfecting Wipes₃ On the Go - 9 count\nLearn more\n1.\nAccording to Mary Gagliardi, Clorox’s in-house scientist and cleaning expert.\n2.\nSource: Protect yourself and others from COVID-19, Flu, and RSV, Centers for Disease Control and Prevention, Updated Nov. 1, 2023,\nhttps://www.cdc.gov/respiratory-viruses/index.html\n*\nAlways follow manufacturer instructions for cleaning and disinfecting electronics.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}