{
    "url": "https://www.clorox.com/learn/how-to-get-marker-out-fabric-clothes/",
    "title": "How to Get Permanent Marker Out of Clothes & Fabric  | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Get Permanent Marker Out of Clothes & Fabric\nWhile permanent marker is created to be just that – permanent, it is possible to get Sharpie or ballpoint ink marks out of your clothes. The secret? Hand sanitizer!\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nWhy do markers stain?\nThe ink in permanent markers is designed to penetrate cellulose (the main part of the cell walls of plants), effectively dyeing cotton fabrics or paper. The added color can be permanent—and it’s supposed to be. But, if something breaks up the ink, the right bleach product can remove the stain.\nEthyl alcohol (ethanol) is very effective at breaking up ink, especially when it is formulated into a hand sanitizer gel. Alcohol-based hand sanitizer easily penetrates the weave or knit of a textile without evaporating too quickly and helps break up the ink stain so it’s easier for the appropriate bleach product to completely remove the stain.\nRelated Articles\nHow to Get Ink Stains Out of Clothes, After Drying or Fresh\nTips for removing permanent marker stains\nIf something breaks up a permanent marker stain, such as alcohol-based hand sanitizer, it’s easier for the right bleach product to remove the stain.\nClorox® Disinfecting Bleach should never be used full strength to treat a stain. Instead, use a bleach and water solution made with ¼ cup\nClorox® Disinfecting Bleach\nadded to ¾ cup water. Apply the bleach and water solution to the stain and then immediately machine wash the item using detergent and ⅓ cup Clorox® Disinfecting Bleach.\nKeep reading to learn more about removing difficult permanent marker stains.\nRelated products\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nWhat you need\nClear alcohol-based hand sanitizer\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nSteps to remove permanent marker from white bleach-safe fabrics\nPre-treat with alcohol-based hand sanitizer\nUse enough to saturate the stain. This will start to break up the ink, and you will see the stain begin to lighten. Let the hand sanitizer gel stay on the ink stain for a few minutes before continuing.\nPre-treat with bleach\nPretreat again by soaking the stain in a bleach and water solution made with ¼ cup\nClorox® Disinfecting Bleach\nadded to 1 gallon of water for 5 minutes.\nTip\nAlways avoid bleaching wool, silk, mohair, leather and spandex.\nMachine wash\nImmediately wash the item per instructions on the\ncare label\nwith detergent and ⅓ cup\nClorox® Disinfecting Bleach\n.\nAir dry\nAir dry and check to make sure stain removal was a success.\nSteps to remove permanent marker from items with color or white items with spandex\nPre-treat with alcohol-based hand sanitizer\nUse enough to saturate the stain. This will start to break up the ink, and you will see the stain begin to lighten. Let the hand sanitizer gel stay on the ink stain for a few minutes before continuing.\nApply Liquid Clorox 2® for Colors to the stain\nUse the cap to apply the\nClorox 2®\nproduct directly to the stain and gently rub it in. Allow the Clorox 2® product to stay on your fabric for 10 minutes.\nTip\nDo not let Clorox 2® dry out on the fabric. Use a timer to monitor the pretreating time.\nMachine wash\nWash the item in the hottest water recommended on the care label with detergent and more\nClorox 2® for Colors 3-in-1\n.\nAir dry\nAir dry and check to make sure stain removal was a success.\nRemember, it’s important to avoid bleaching clothing that contains spandex—and any items with wool, silk, mohair or leather. That’s why we recommend washing white items with spandex with Clorox 2®.\nSteps to remove black felt tip pen ink from colored fabric\nPre-treat with alcohol-based hand sanitizer\nUse enough to saturate the stain. This will start to break up the ink, and you will see the stain begin to lighten. Let the hand sanitizer gel stay on the ink stain for a few minutes before continuing.\nApply Liquid Clorox 2® for Colors to the stain\nUse the cap to apply the\nClorox 2®\nproduct directly to the stain and gently rub it in. Allow the Clorox 2® product to stay on your fabric for 10 minutes.\nTip\nDo not let Clorox 2® dry out on the fabric. Use a timer to monitor the pretreating time.\nMachine wash\nWash the item in the hottest water recommended on the care label with detergent and more\nClorox 2® for Colors 3-in-1\n.\nAir dry\nAir dry and check to make sure stain removal was a success.\nSteps to remove black felt tip pen ink from white items that don't contain spandex\nPre-treat with alcohol-based hand sanitizer\nUse enough to saturate the stain. This will start to break up the ink, and you will see the stain begin to lighten. Let the hand sanitizer gel stay on the ink stain for a few minutes before continuing.\nPretreat with bleach\nPretreat again by soaking the stain in a bleach and water solution made with ¼ cup\nClorox® Disinfecting Bleach\nadded to 1 gallon of water for 5 minutes.\nMachine wash\nImmediately wash the item in hot water with detergent and ⅓ cup\nClorox® Disinfecting Bleach\n.\nAir dry\nAir dry and check to make sure stain removal was a success.\nIt’s important to note that ink from felt tip pens is very concentrated and commonly bleeds onto fabric. So, it may require you to repeat the treatment multiple times to get the stain out.\nSteps to remove ballpoint pen ink from colored or white fabrics with spandex\nPre-treat with alcohol-based hand sanitizer\nUse enough to saturate the stain. This will start to break up the ink, and you will see the stain begin to lighten. Let the hand sanitizer gel stay on the ink stain for a few minutes before continuing.\nApply Liquid Clorox 2® for Colors to the stain\nUse the cap to apply the\nClorox 2®\nproduct directly to the stain and gently rub it in. Allow the Clorox 2® product to stay on your fabric for 10 minutes.\nTip\nDo not let Clorox 2® dry out on the fabric. Use a timer to monitor the pretreating time.\nMachine wash\nWash the item in the hottest water recommended on the care label with detergent and more\nClorox 2® for Colors 3-in-1\n.\nAir dry\nAir dry and check to make sure stain removal was a success.\nCheck out this\narticle\nto learn how to remove gel pen ink stains.\nFrequently Asked Questions\nCan permanent marker be removed?\nPermanent marker stains can be tough to remove from clothes, but it's not impossible. The most effective method to remove permanent marker from clothes depends on the type of fabric and the type of marker used – and Clorox has you covered. By following the above instructions, you should be able to remove permanent marker from clothes with no problem.\nWhat are the do’s and don’ts for removing marker stains?\nDo\nuse alcohol-based products to break up ink before applying a bleach product.\nDo\nkeep items out of a hot dryer until you know the stain is completely gone.\nDo\nrepeat the pretreatment step if necessary.\nDon’t\nforget to pretreat a second time with the appropriate bleach product after pretreating with alcohol-based hand sanitizer.\nHow do you get marker stains out of upholstery?\nPermanent marker stains are very difficult to remove from soft surfaces like fabric, carpet and upholstery because of the nature of the ink—it’s supposed to be permanent.  But, if you can machine wash an item (sorry carpet and upholstery), and pretreat the stains with hand sanitizer before pretreating with the appropriate bleach product, the chance of removing the stains improves.  However, laundry products aren’t appropriate for use on carpet or upholstery because they require too much water for a thorough rinsing.\nHow do you remove marker stains from other surfaces, like a kitchen counter?\nClorox® Clean-Up® Cleaner + Bleach\ncan remove marker stains from hard, bleach-safe, nonporous surfaces.\nHow do you remove dried marker stains?\nMarkers are designed to dry quickly. So, stains, in general, are dry because of the nature of the staining material. The steps for removing permanent marker stains apply to both fresh and older stains.\nCan milk remove ink stains?\nIf you use milk to rinse a fresh ink stain, it may reduce the amount of stain you have to treat. But, the lactic acid in milk is not enough to break up the ink for complete removal. It’s better to use alcohol-based hand sanitizer to pretreat ink stains before using the appropriate bleach product to get the stain all the way out.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}