{
    "url": "https://www.clorox.com/learn/how-to-do-bleach-art-on-clothes/",
    "title": "How to Do Bleach Art on Clothes | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Do Bleach Art on Clothes\nFeeling creative? You can make unique DIY bleach art on fabric with Clorox® Disinfecting Bleach. Transform your closet by learning how to do bleach design art on shirts, jeans and other clothing here.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nWhether it’s refreshing clothing you already own or turning a thrift store find into a unique art piece, you can use a simple bleach and water solution to create one-of-a-kind designs on your shirts, jeans and even a onesie for a baby. The technique is simple: apply the bleach and water solution, wait a few minutes until you are happy with the results, then use a hydrogen peroxide solution to stop the bleaching action.\nGet creative! To make galaxy art, simply spray the solution lightly onto a t-shirt. Or use stencils to apply stars to blue jeans. Painter’s tape can make perfectly even stripes. Plastic cookie cutters can be used to stamp designs onto fabric. While we’ve written about\nusing bleach to create reverse tie dye effects\nbefore, the goal here is to further unleash your creativity — the possibilities are endless!\nRelated Articles\nHow to Test Fabric for Colorfastness to Bleach\nChoosing the right garment for bleach art\nSome dyes are actually colorfast to bleach and water solutions. You won’t always know just by looking at the color, so before you start\ntest for colorfastness to bleach\nand make sure the item you want to update actually will change color.\nFiber type matters, too. Cotton, rayon and linen are more likely to lose or change color than synthetics like polyester, acrylic or nylon. And remember to avoid bleaching wool, silk, mohair, leather and spandex because these fiber types aren’t safe for bleach. Care labels include fiber content, so be sure to read them to confirm the fiber content before you start.\nWhat you need\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nSpray adhesive\n3% hydrogen peroxide\nCardboard\nScissors\nStencil(s)\nPainter's tape\n24 oz. plastic spray bottle\nMeasuring cup\nPaper towels\nCotton towel\nSteps to use bleach to make art on clothes\nPrepare a work area\nChoose a work area with a bleach-safe surface like a kitchen countertop. Clear the area and wipe the counters down before starting.\nPrepare the clothing\nInsert cardboard pieces cut to fit inside a garment to prevent any bleach and water solution from bleeding through from the top to the bottom.\nPlan the design layout\nIf using stencils, lay them out on the garment to see where they look best. When you are satisfied, secure them in place with the spray adhesive.\nTip\nIf you don’t have pre-made plastic stencils, you can make your own with manila file folders, cutting out simple designs with a utility knife.\nTip\nTo make stripes with painter’s tape, apply the tape to the fabric evenly and smooth it in place.\nPrepare the bleach solution\nLabel the first spray bottle “bleach solution” before adding ½ cup\nClorox® Disinfecting Bleach\nfollowed by 2 cups of water. Replace the sprayer mechanism and set the nozzle to mist.\nTip\nBefore spraying any bleach onto your project, spray a few times into the sink to make sure the nozzle setting is set on mist.\nPrepare the fixing solution\nLabel the second spray bottle “hydrogen peroxide solution” before adding ½ cup hydrogen peroxide followed by 2 cups of water.\nApply the bleach solution\nCarefully spray the bleach solution onto the garment (inside the stencil if using) until the fabric is wet. Let stand for a few minutes as you monitor the color change\nTip\nWhen spraying a stencil, blot up any extra bleach and water solution with a paper towel so it doesn’t spread beyond the edges of the stencil.\nTip\nFor galaxy art, just spray a little bleach solution lightly in a few places; don’t saturate the shirt.\nStop the bleaching action\nWhen you are happy with the color change, before removing the stencil, spray the treated area completely with the hydrogen peroxide solution to fix the color and stop any additional color change. It’s important to spray both the stencil and the clothing to prevent bleach drips from discoloring untreated parts of the item.\nRinse thoroughly\nRinse thoroughly, removing the stencil as you work.\nAir dry\nRoll the item in a clean dry towel and squeeze it to remove excess moisture before hanging to air dry.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}