{
    "url": "https://www.clorox.com/learn/how-long-should-you-soak-clothes-in-bleach/",
    "title": "How Long Should You Soak Clothes in Bleach? | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow Long Should You Soak Clothes in Bleach?\nYou can add bleach to every load of bleach-safe laundry along with your regular detergent to clean, whiten, remove stains and sanitize your clothes. Detergent alone is not enough.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nClorox® Disinfecting Bleach\nkeeps white clothes their whitest and kills 99.9% of germs in your laundry. It works better than detergent alone on hard-to-remove stains including berries, juice, mud/dirt, ketchup, grass, coffee, red wine and tea.\nBleach is environmentally friendly\nWhile they are sometimes referred to as “chlorine bleach,” there is no elemental or free chlorine in our bleach products. The sodium hypochlorite bleach active in\nClorox® Disinfecting Bleach\noxidizes soils and stains, and in the process breaks down almost entirely into salt and water. This makes it quite environmentally friendly. Since it’s even effective in cold water, you can save energy and still get great laundry results compared to detergent alone.\nRemember to always check care labels to confirm fiber content before washing; avoid bleaching wool, silk, mohair, leather, spandex and non-fast colors.\nQuestion\nI always presoak my whites in hot water with\nClorox® Disinfecting Bleach\n. Is there an optimal amount of time for this phase?\nAnswer\nGenerally, with presoaking, we recommend a limited exposure time prior to washing (1/4 cup\nClorox® Disinfecting Bleach\nin a gallon of warm water for 5–10 minutes before laundering). Wash in the hottest water recommended on the care label with detergent and 1/3 cup\nClorox® Disinfecting Bleach\n.\nRelated products\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}