{
    "url": "https://www.clorox.com/learn/how-to-get-dried-ink-out-of-clothes/",
    "title": "How to Get Ink Stains Out of Clothes, after Drying or Fresh | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Get Ink Stains Out of Clothes, After Drying or Fresh\nRemoving pen, ballpoint or felt-tip ink stains from material like canvas and cotton is possible even after drying. With hand sanitizer and fabric treatment, you can remove stubborn stains.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nBecause ink is designed to stay on whatever surface you apply it to, when pen marks stain clothing and fabric, machine washing won’t be enough to get the stain out.\nInstead, you need to use a special stain pretreating technique prior to machine washing, starting with clear alcohol-based hand sanitizer gel. The alcohol and thickening agents in the hand sanitizer help it soak into your fabric and begin to dissolve the ink stain. Then you pretreat again with\nLiquid Clorox 2® for Colors\n, which is appropriate for nearly all machine washable items, including jeans and colored clothes.\nRelated Articles\nWhat Is Color Safe Bleach and How to Use It\nHow to Use Bleach in Laundry to Clean, Whiten, Remove Stains and Sanitize\nThis technique is effective on a variety of different types of ink, from pen ink to highlighter and marker stains. Once you’ve tried it, you’ll see just how easy it is to get ink stains out all the way, even if they’ve been dried through a hot dryer.\nWhat you need\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nAlcohol Based Hand Sanitizer Gel\nPaper towels\nSteps to remove ink stains from colored clothes & white items with spandex\nPre-treat with alcohol-based hand sanitizer\nUse enough to saturate the stain. This will start to break up the ink, and you will see the stain begin to lighten. Let the hand sanitizer gel stay on the ink stain for a few minutes before continuing.\nTip\nIf the ink is fresh, blot it with a paper towel first, to remove excess ink.\nApply Liquid Clorox 2® for Colors to the stain\nUse the cap to apply the\nClorox 2®\nproduct directly to the stain and gently rub it in. Allow the Clorox 2® product to stay on your fabric for 10 minutes. Set a timer so you don’t lose track of the time and leave it on any longer. Do not let the product dry on your clothing.\nTip\nDo not let Clorox 2® dry out on the fabric. Use a timer to monitor the pretreating time.\nMachine wash\nAfter 10 minutes, pretreating is complete and it’s time to machine wash your clothes. Select the hottest water possible, and add a little more Clorox 2® along with your regular laundry detergent.\nAir dry\nAir dry and check to make sure stain removal was a success.\nYou can always repeat the two pretreatment steps to get a super concentrated ink stain all the way out.\nTip\nFor items labeled “machine wash cold” consider using a “warm” wash temperature to improve your chances of getting the stain out.\nSteps to remove ink stains from white bleach-safe clothes\nPre-treat with alcohol-based hand sanitizer\nUse enough to saturate the stain. This will start to break up the ink, and you will see the stain begin to lighten. Let the hand sanitizer gel stay on the ink stain for a few minutes before continuing.\nTip\nIf the ink is fresh, blot it with a paper towel first, to remove excess ink.\nSoak clothing in water & Clorox® Disinfecting Bleach\nMix ¼ cup of\nClorox® Bleach\nper gallon of water. Fully submerge the clothing in the bleach and water solution for 5 minutes. When soaking is complete, pour off the bleach and water solution and you are ready to machine wash the item.\nTip\nAlways avoid bleaching wool, silk, mohair, leather and spandex.\nMachine wash\nWash according to the instructions on the care label, add your favorite detergent and pour 1/3 cup Clorox® Disinfecting Bleach into the bleach dispenser.\nAir dry\nAir dry and check to make sure stain removal was a success.\nYou can always repeat the two pretreatment steps to get a super concentrated ink stain all the way out.\nTip\nFor items labeled “machine wash cold” consider using a “warm” wash temperature to improve your chances of getting the stain out.\nFrequently Asked Questions\nCan I get permanent marker out of my clothes?\nPermanent markers are designed to be just that, permanent. Even so, if you repeat the two-step pretreatment method including hand sanitizer and machine wash a few times, there’s a chance you will successfully get rid of the marker stain! For more detailed steps, check out\nHow to Get Marker Out of Fabric and Clothes.\nCan I use full-strength Clorox® Bleach on ink stains?\nNo.\nClorox® Disinfecting Bleach\nshould always be diluted with water first before allowing it to contact any soft or hard surface. Don’t give in to the temptation to apply full strength bleach to ink stains — in time the area that was exposed to undiluted bleach could end up with a hole.\nInstead, if you have an ink stain on a bleach-safe item you can always pretreat it with a bleach and water solution made with ¼ cup bleach added to ¾ cup water. Apply the bleach and water solution to the stain and then immediately machine wash the item using detergent and ⅓ cup Clorox® Disinfecting Bleach. Remember to pretreat with alcohol-based hand sanitizer first before applying the bleach and water solution!\nCan hand sanitizer stain clothes?\nAlcohol-based hand sanitizer (the ingredient list will say ethyl alcohol, ethanol or isopropyl alcohol) should not stain clothes. Alcohol-free hand sanitizers may include ingredients that do permanently stain or lighten clothes and should be avoided for pretreating. It’s another reason why we only recommend alcohol-based hand sanitizer for pretreating ink stains.\nCan I get ink out of clothes after drying?\nInk stains that have been through a hot dryer will be more difficult to remove, but not impossible. You may need to repeat the steps a few times for complete removal.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}