{
    "url": "https://www.clorox.com/learn/how-to-clean-and-sanitize-leather/",
    "title": "How to Clean and Sanitize Leather  &nbsp; | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Clean and Sanitize Leather\nLeather needs special care to help it retain its beauty. Leather couches are a special challenge when exposed to germs, but can be cleaned and sanitized with the same technique as other leather items.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nMade from the hides of animals, finished leather is a natural material that requires special care. Only products that won’t dry it out or cause cracking should be used. This makes caring for leather items more of a challenge, especially when they have been exposed to germs.\nFortunately, now you can sanitize leather with\nClorox® Disinfecting Mist\nwhen it’s time to kill germs on your favorite leather couch, purse, boots, wallet and clothes.\nSince the same techniques can be used on small and large finished leather items, we provide details for how to clean and sanitize a leather couch. You can adapt the technique for smaller, easier items.\nStart by cleaning the leather item (if necessary), and then spray on the sanitizer to kill 99.9% of bacteria like Staph.\nDo not use Clorox® Disinfecting Mist on suede or nubuck, or any unfinished leather surface.\nRelated Articles\nHow to Wash and Sanitize a Backpack, and Remove Mold\nWhat you need\nLeather cleaning wipes\nClorox®\nDisinfecting Mist, Multi-Surface\nLearn more\nMicrofiber cloth\nVacuum with upholstery attachment\nSteps to clean and sanitize a leather couch\nDust, then vacuum the couch\nUse the microfiber cloth to pick up any dust from the surface of the couch and the cushions. Use the vacuum’s crevice tool to remove dirt and pet hair from inside seams and behind cushions.\nWipe the leather with the cleaner\nGently wipe the body of the couch with a leather cleaning wipe to remove any soils. Wipe the cushions, too.\nSpray with Clorox® Disinfecting Mist\nTest in an inconspicuous area first. Hold the trigger 6–8 inches from the surface of the couch and spray lightly over it until wet; do not saturate.\nTip\nTo sanitize, the surface should remain wet for 1 minute.\nAllow to air dry\nReplace cushions when the couch has dried completely. Always use as directed.\nThe steps to clean and sanitize a leather couch are the same ones you’d use to clean other items made with leather. Depending on the item, vacuuming may not be necessary, but you should still wipe any dust off the surface before cleaning.\nNever use Clorox® Disinfecting Bleach, or any other product containing sodium hypochlorite, to treat any type of leather or animal hide.\nFrequently Asked Questions\nCan I sanitize leather without cleaning it first?\nIf your leather item is newer or has recently been cleaned, and you are only interested in sanitizing it to kill germs, then you can skip the cleaning step and just spray Clorox® Disinfecting Mist onto the surface as directed.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}