{
    "url": "https://www.clorox.com/learn/how-to-clean-couch-cushion-covers-with-bleach/",
    "title": "How to Clean & Sanitize Couch Slipcovers, Cushions and Throw Pillows | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Clean & Sanitize Couch Slipcovers, Cushions and Throw Pillows\nClorox makes it easy to learn how to clean and sanitize couch slipcovers, cushions and throw pillows. Clorox® Disinfecting Mist spot sanitizes leather, fabric, and microfiber couches.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nCan I use\nClorox\n®\nDisinfecting Bleach\non a slipcover that’s not solid white? I don’t mind if the bleach lightens the fabric, it’s just so soiled that I want it brighter.\nAnswer\nIf the slipcover is cotton or cotton/polyester, then you can wash it with\nClorox® Disinfecting Bleach\n.  Here are some other considerations for how you can proceed:\nWash in hot water using a good detergent and ⅓ cup\nClorox® Disinfecting Bleach\n.\nIf the slipcover is very dirty, start by soaking the entire slipcover (and any cushion covers and matching throw pillows) fully submerged in a bleach solution of ¼ cup\nClorox® Disinfecting Bleach\nper gallon of water for 5 minutes.  Drain the soaking solution and then wash as described above.\nAvoid shrinkage — keep the slip cover pieces out of the dryer. Instead, put them back on the couch before they dry. This is especially important for cushion covers, which need to be stretched over the cushions while still damp or they won’t fit back on again.\nIf the slipcover is made of nylon or rayon, I would still expect it to be bleachable, but I would confirm this first with a bleachability test: add 2 teaspoons bleach to ¼ cup water and apply a drop of this solution to a less-visible part of the slipcover. Wait 1 minute and then rinse and blot dry — any color change will give you an idea what to expect if you bleach the slipcover. In fact you may even want to do this if the slip cover is made of cotton, and you may also want to check any topstitching thread to see if that will shift color when bleached.\nIf you decide you don’t want to use bleach on the slipcover, then I would try an overnight pre-soak using\nClorox 2® for Colors Powder\n. Use a ratio of 1 scoop Clorox 2® per 2 gallons of hot water—make sure the powder has completely dissolved and then add the slip cover to the soaking solution. Make sure it is fully submerged (weigh it down if you need to) and let it sit overnight or up to 8 hours.  Drain the soaking solution and then wash in hot water using detergent and more Clorox 2®. Air dry as described above.\nLearn more about using\nClorox® Disinfecting Mist\nto sanitize leather and other soft surfaces\nhere\n.\nRelated products\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nClorox 2® for Colors\nStain Remover & Color Brightener Powder\nLearn more\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}