{
    "url": "https://www.clorox.com/learn/how-to-bleach-white-clothes/",
    "title": "How to Bleach White Clothes | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Bleach White Clothes\nClorox has built its reputation on helping people keep white clothes as clean and bright as possible. If you’ve noticed that your laundry isn’t as vibrant as it could be, we’ll show you how easy it is to clean and brighten them up.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nIf your white clothes tend to turn slightly off-white or yellowish over time, standard bleach in your wash may not do the trick. Here are a few possible issues that you may need to address.\nRelated Articles\nHow to Clean and Get Rid of Mold on Windows with Bleach\nHow to Use Bleach in Laundry to Clean, Whiten, Remove Stains and Sanitize\nChoosing a detergent\nMake sure you’re using a good detergent that contains brighteners and enzymes in addition to surfactants and builders.\nTip\nThe better detergents will often list the purpose of active ingredients.\nUse the right amount of detergent\nUnderutilizing laundry detergent will result in poor performance, especially if you have heavily soiled shirts, do extra-large loads, or use hard water. Try adding a little extra detergent.\nDial up the temperature\nChoose a hot wash temperature on your machine. The higher the wash temperature, the better the cleaning.\nProperly load your washer\nClothes need to circulate/tumble freely through the wash water for optimum cleaning.\nUse the right amount of bleach\nThat’s ¾ cup for a regular load, and 1¼ cup for an extra-large or heavily soiled load.\nTip\nDoes your washer limit bleach to ⅓ cup? Wash in smaller loads and fill the dispenser to the “max fill” line.\nWhat you need\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nDishpan\nSteps to whiten white cotton clothes\nIf your clothing doesn’t contain any spandex, here’s how we recommend using bleach to brighten them up.\nSoak your clothing\nSoak clothes in a solution of ¼ cup\nClorox® Disinfecting Bleach\nper gallon of water. Fully submerge for 5 minutes.\nMachine wash in hot water\nWash in hot water using detergent and 1/3 cup bleach (or fill the dispenser to the max-fill line) to remove dingy yellow buildup.\nSteps to whiten white clothes with spandex\nIf your white clothing contains any spandex, you’ll want to use\nClorox 2® for Colors Stain Remover and Laundry Additive\ninstead of regular bleach.\nPre-soak your clothing\nMix 1 cup of\nClorox 2® for Colors\nto 2 gallons of water, and submerge clothing. You can soak up to 1 hour with liquid\nClorox 2®\n, or 8 hours when using the powder as directed.\nRinse and wash in hot water\nPour off the soaking solution, then machine wash in hot water using detergent and additional\nClorox 2®\n.\nFrequently Asked Questions\nShould you bleach white clothes?\nCheck your garment's care label to confirm if it's bleach safe.\nCan bleach discolor my clothes?\nThere are a few situations when using\nClorox® Disinfecting Bleach\ncan discolor white fabrics. If a fabric or a fabric’s finish isn’t bleach-safe, bleach can cause damage and yellowing. Even cotton can yellow if exposed to undiluted or extremely concentrated bleach solutions. Additionally, household water supplies can contain high levels of metal that react with bleach and discolor clothing.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}