{
    "url": "https://www.clorox.com/learn/how-to-get-bleach-smell-out-of-clothes/",
    "title": "How to Get Bleach Smell Out of Clothes | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Get Bleach Smell Out of Clothes\nBleach is a great cleaning and disinfecting agent but some people don't like the smell of bleach. Learn how to remove the bleach smell from clothes and fabrics.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nQuestion\nHow do I get the Clorox® Bleach smell out of my blouse which is made of rayon?\nAnswer\nTo remove a lingering bleach smell from a garment, try a pre-soak with\nClorox 2® for Colors Stain Remover and Laundry Additive\n. Just fill the cap all the way up and add it to 1 quart of water. Fully submerge the shirt for at least 5 minutes and no more than 1 hour. This will allow the hydrogen peroxide in\nClorox 2® for Colors Stain Remover and Laundry Additive\nto react with any residual regular bleach on the shirt. Then thoroughly rinse the shirt and allow it to air dry.\nRelated products\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}