{
    "url": "https://www.clorox.com/learn/difference-between-chlorine-and-non-chlorine-bleach/",
    "title": "The Difference Between Chlorine &amp; Non-Chlorine Bleach  &nbsp; | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nThe Difference Between Chlorine and Non-Chlorine Bleach\nThe bleach instructions on a garment care label will tell you if “any bleach,” “only non-chlorine bleach” or “do not bleach” is recommended. Here’s what that means.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nUsing bleach on whites\nLaundry bleaches have a long history of home consumer use. First, there was regular bleach (sodium hypochlorite, NaOCl) which was first used for white cotton fabrics. The hypochlorite bleach active (\n-\nOCl) in regular bleach is often referred to as “chlorine bleach” even though there’s no elemental or free chlorine in a bottle of bleach or in the laundry when the bleach is added.\nRegular bleach is not safe for some dyes and fabric types, including spandex, wool, silk, mohair and leather. However, it is safe for cotton, linen, rayon, polyester, nylon and acrylic fibers, unless a dye or finish on the fabric is not compatible with bleach.\nTip\nLaundry bleach is always added along with detergent to improve cleaning, brightening, whitening and stain removal.\nRelated Articles\nHow to Use Bleach in Laundry to Clean, Whiten, Remove Stains and Sanitize\nHow to Kill Flu Germs and Disinfect Laundry\nRelated products\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nClorox®\nSplash-Less® Bleach\n1\n- Concentrated Formula\nLearn more\nUsing bleach on colors\nNext came oxygen bleaches (hydrogen peroxide, sodium perborate, sodium carbonate) that are safe for virtually all machine washable fabrics. Peroxide bleach doesn’t contain chlorine, and is referred to on garment care labels as “non-chlorine bleach”.\nTip\nIf unsure bleach is safe for an item, test on a hidden area before washing with bleach. Always avoid bleaching wool, silk, mohair, leather, spandex, and non-fast colors.\nOxygen bleaches are also referred to as color-safe or all-fabric bleaches. These products are also ideal for washing white items with spandex that can’t be washed with regular bleach.\nRelated Articles\nWhat Is Color Safe Bleach and How to Use It\nRelated products\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nClorox 2® for Colors\nStain Remover & Color Brightener Powder\nLearn more\nClorox 2® for Colors\nStain Remover & Color Brightener Packs\nLearn more\nClorox 2® for Colors\nMax Performance Stain Remover and Laundry Additive\nLearn more\nClorox 2® for Colors\nFree & Clear Stain Remover & Color Brightener Packs\nLearn more\nBleach innovations\nNow, there are also\nBleach Packs\nand\nConcentrated Bleach Powder\nthat behave similarly to sodium hypochlorite bleach once dissolved in water. We’re lucky to have multiple product choices for improving detergent performance so we can properly wash a wide range of garments!\nRelated products\nClorox®\nZero Splash™ Bleach Packs™\nLearn more\nClorox®\nConcentrated Bleach Powder\nLearn more\nCare labels and bleach instructions\nCare labels use a minimum of detail, but it’s easy to tell which type of bleach to use depending on which care symbol is on the label.\nL to R: Any bleach as needed, non-chlorine bleach as needed, do not bleach.\nA care label that reads\n“Any Bleach”\nmeans you can use either sodium hypochlorite bleach or peroxide bleaches.\nA care label that reads\n“Only non-chlorine Bleach”\nmeans only oxygen or color-safe bleaches may be used.\n“Do Not Bleach”\nmeans no bleach should be used, unless you check the fiber content and test for colorfastness with any bleach product you want to try first. Always read and follow instructions on laundry product labels to ensure correct product use.\nChlorine bleach vs. non-chlorine bleach at a glance\nChlorine Bleaches\nNon-Chlorine Bleaches\nBleach Ingredients\n• Sodium Hypochlorite\n• Sodium Dichloroisocyanurate\n• Hydrogen Peroxide\n• Sodium Perborate\n• Sodium Percarbonate\nCommon Names\n• Regular Bleach\n• Household Bleach\n•\nClorox® Disinfecting Bleach\n•\nClorox® Splash-Less® Bleach\n•\nClorox® Zero Splash™ Bleach Packs\n• Oxygen Bleach\n• Peroxide Bleach\n• Color-Safe Bleach\n• All Fabric Bleach\n•\nClorox 2® for Colors\nWhat Can You Wash?\n• Some items with color — must be colorfast to bleach\n• White items WITHOUT Spandex\n• Cotton\n• Polyester\n• Nylon\n• Acrylic\n• Rayon\n• Most items with color\n• White items with Spandex\n• Cotton\n• Polyester\n• Nylon\n• Acrylic\n• Rayon\n• Spandex\nColorfastness Test\nAdd 2 teaspoons of bleach to ¼ cup water and apply a drop to a hidden part of the item. Wait 1 minute then rinse and blot dry. Item is colorfast if there is no color change.\nApply a drop of full-strength\nliquid Clorox 2®\nto a hidden part of the item. Wait 5 minutes, then rinse and blot dry. Item is colorfast if there is no color change.\nFrequently Asked Questions\nDoes Clorox make a non-chlorine bleach?\nYes.\nClorox 2® for Colors\nis a non-chlorine bleach with hydrogen peroxide as its active ingredient.\nDoes non-chlorine bleach sanitize?\nFor a laundry product to make a germ kill claim, it needs an EPA Registration, which Clorox2 products do not have at this time. To sanitize items with color or spandex that cannot be bleached, you can always use\nClorox® Laundry Sanitizer.\nDoes Clorox 2® have bleach in it?\nOur\nClorox 2® for Colors Stain Remover and Laundry Additive\nhas hydrogen peroxide as its active ingredient and is in the class of oxygen, color-safe (or non-chlorine) bleach. Compare this to our\nClorox® Disinfecting Bleach with CLOROMAX®\n, which uses sodium hypochlorite as its active ingredient and is in the class of chlorine bleach.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}