{
    "url": "https://www.clorox.com/learn/how-to-clean-floors-by-mopping-with-bleach/",
    "title": "How to Clean Floors by Mopping with Bleach | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Clean Floors by Mopping with Bleach\nWhen it’s time to clean your floors, mix up a bleach and water solution, and let the power of Clorox get to work. Bleach works great on vinyl, nonporous tile and even grout.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nHard, nonporous flooring surfaces, especially those in bathrooms and kitchens, can be easily cleaned with a Clorox bleach and water solution. It’s as simple as mixing up bleach and water, mopping it on, rinsing it off and letting everything air dry.\nDo not use on aluminum, chipped or cracked enamel, copper, brass, silver or unsealed wood, marble, tile or granite.\nAvoid contact with aluminum; if accidental contact occurs, rinse immediately with water.\nRelated Articles\nBleach Dilution Ratio Chart for Disinfecting\nHow to Dilute Bleach for Cleaning and Avoid Residue\nHow to Clean Hardwood Floors\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nBroom or vacuum\nProtective gloves\nPlastic bucket\nMeasuring cup\nMop or sponge\nNylon scrub brush\nSteps to clean your floors with bleach\nOpen windows to improve ventilation.\nStart by opening windows to allow good air circulation in the area you’re cleaning. For rooms without windows, you can also use a fan to improve air circulation.\nSweep up or vacuum loose dirt and dust.\nGetting rid of loose dirt before applying the bleach solution will make mopping easier.\nMix up the bleach and water solution.\nFill a plastic bucket with 1 gallon of cool water, then add 1/3 cup\nClorox® Bleach\n. Wear gloves and clothing that you don’t mind accidentally splashing with bleach solution.\nSponge or mop the solution onto the floor.\nApply the solution and allow it to contact the surface for 6 minutes. Scrub as needed with a nylon brush if necessary to remove tough stains.\nTip\nTo disinfect with this bleach and water solution, pre-clean the floor by wiping away organic matter before applying the bleach and water solution.\nRinse with clean water and air dry.\nEmpty the bucket with the bleach and water solution, rinse it, and fill with clean water. Use this to rinse the floor before letting the area air dry completely.\nTip\nThis solution is safe to use in a home with pets and children — just be sure to keep them out of the area while you are working, until the floor has dried.\nFrequently Asked Questions\nCan you use bleach to clean hardwood floors?\nIn general, bleach is not recommended for cleaning hardwood floors.\nPine-Sol\nis a great product for hardwood floors; just be sure the polyurethane finish on your flooring is in good condition with no worn spots before cleaning. Always test a small inconspicuous area before cleaning a hardwood floor.\nCan I use Clorox® Splash-Less Bleach~1~ to mop my floors?\nYes, but the amount of bleach per gallon of water is different. With our\nSplash-Less® Bleach\n, use ½ cup bleach per gallon of water.\nDoes this solution disinfect floors?\nYes, as long as the floor is free of visible soil before you begin. For visibly soiled surfaces, pre-clean the surface before disinfecting and be sure the bleach and water solution contacts the surface for 6 minutes before rinsing.\nI bought my bleach at warehouse store and it has a different name. Can I use it instead?\nYes. Depending on where you buy your bleach, you could also use any of the following: Clorox® Bleach\n1\n, Clorox® Regular Bleach\n3\n, Clorox® Performance Bleach\n2\nand Clorox® Germicidal Bleach\n4\n.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}