{
    "url": "https://www.clorox.com/learn/how-to-bleach-tie-dye-patterns/",
    "title": "How to Tie Dye with Bleach  &nbsp; | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Reverse Tie Dye with Bleach\nLearn how to use bleach to make different tie dye patterns on colored clothes, including spiral tie dye. Follow our step-by-step instructions and create unique designs on shirts, dresses and hoodies.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nThe color from tie dye kits never seems to last that long and is difficult to maintain when the color easily comes out in the wash. That doesn’t happen when you use\nClorox® Disinfecting Bleach\nto remove or change the color in already dyed clothing. So get creative!\nRelated products\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nTwist some rubber bands around your shirts, dresses, and even sweatshirts, then soak them in the bleach and water solution. Create designs like circles, swirls or bands of color where you twist on the rubber bands. By working with a bleach and water solution, you won’t have to worry about how to get tie dye off your hands or skin, how long to let tie dye sit, or how to wash tie dye shirts for the first time.\nSometimes the color of the original shirt changes to a new color where it contacts the bleach and water solution (like blue turning pink or purple). Other times the color is almost completely stripped away, resulting in an off-white color of the treated areas. Using bleach to remove or lighten the color of a shirt is also an important first step when you want to apply dye to a dark shirt.\nRelated Articles\nHow to Test Fabric for Colorfastness to Bleach\nChoosing the right shirt\nLook for 100% cotton. Avoid polyester and spandex. How cotton is dyed determines how well it will respond to the bleach solution. Reactive dyes are not colorfast to bleach and will change color easily. Color printed onto cotton using binders varies in how it responds to bleach exposure. Pigment dyes have very high colorfastness to bleach and you may not see that much of a color change.\nYou won’t always know in advance how an item will respond, so test first by applying a drop of a solution made with 2 teaspoons of\nClorox® Disinfecting Bleach\nadded to ¼ cup water to a hidden part of the item. After a few minutes, you will have a preview of what to expect when you bleach the entire shirt.\nRelated Articles\nHow to Test Fabric for Colorfastness to Bleach\nWhat you need\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\n3% hydrogen peroxide\n100% cotton t-shirt\nRubber bands\nPlastic dishpans\nProtective gloves\nMeasuring cup\nScissors\nClean white towel\nSteps to tie-dye a shirt with bleach\nTie your shirt using rubber bands\nTo make multiple circles, gently pinch the shirt where you’d like the center of the first tie dye circle to be and pull up the fabric, forming a tube. Twist a rubber band tightly around the end where you pinched, and then add more rubber bands at intervals down the tube. Repeat starting in a different part of the shirt. Try to make as many rubber-banded circles onto the shirt for the most dramatic effect.\nTip\nTo create one large swirl or spiral, lay the shirt flat on a surface. Find the center and slowly twist the entire shirt into a round flat disk, then secure with rubber bands.\nPrepare the bleach solution\nWearing gloves, add 1 cup\nClorox® Disinfecting Bleach\nto 1 gallon of cool water in the first dishpan, and swirl to mix.\nPrepare the peroxide fixing solution\nRinse the measuring cup with clean water. In the second dish pan, add 1 cup hydrogen peroxide to 1 gallon of water.\nSubmerge your shirt in the bleach solution\nBe sure you have gloves on! Make sure the shirt stays all the way in the solution and swirl it around. Be careful not to splash any solution on yourself or your clothing.\nAfter about 2 minutes, check the color change\nRemove the shirt completely from the solution (hold it over the dishpan to catch drips) and slightly pull back a rubber band. If desired, return the shirt to the bleach solution for a greater color change.\nStop the bleaching action\nWhen satisfied with the color change (or if 5 minutes have passed), transfer the shirt to the second dishpan with the hydrogen peroxide solution. Use the scissors to carefully cut away the rubber bands, being careful not to cut the fabric. Swirl the shirt around in the peroxide solution until the fabric stops fizzing.\nRinse with water\nThoroughly rinse the shirt several times with cool water.\nAllow to air dry\nRoll the shirt in the towel and squeeze out excess water before hanging it to air dry.\nFrequently Asked Questions\nHow do you wash a tie dyed shirt the first time?\nHome application of dyes to fabric tend not to be very colorfast. When washing clothing you have hand dyed, use only very gentle washing techniques. Choose a mild liquid detergent and use cool water. Air dry to avoid exposure to any dryer heat, which will further lighten the colors. Remember that when you use bleach to create tie dye effects on a commercially made shirt, you don’t have to worry about this!\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}