{
    "url": "https://www.clorox.com/learn/what-do-laundry-symbols-mean-how-to-read-washing-symbols/",
    "title": "What Do Laundry Symbols Mean? | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nWhat Do Laundry Symbols Mean?\nTriangles, squares, circles — oh my! We’ll help you decipher those laundry symbols on your garment tags so your clothes come out looking great, every wash.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nWouldn’t it be great if each piece of clothing we bought came with highly detailed care instructions, so we’d never worry about damaging it in the wash? Unfortunately, it’s tough to fit all that on a tiny garment tag. That’s where laundry symbols come in — they’re shorthand for things like recommended water temperature, to bleach or not to bleach and so much more. On some care labels, symbols have replaced written care instructions entirely. Keep scrolling to check out our guide to laundry symbols. And here’s a tip: bookmark this page for easy access in the future!\nRelated Articles\nThe Difference Between Chlorine and Non-Chlorine Bleach\nHow to Test Fabric for Colorfastness to Bleach\nGuide to the most common care symbols\nWith lots of different options for water temperature, agitation, laundry additives and drying, there are a lot of possibilities for what care symbols you’ll find on a piece of clothing or home textile like a tablecloth. We’ve summarized the most common symbols on a chart for easy reference.\nWhat do triangle symbols mean?\nThe triangle provides instructions for using bleach, but there are a few different versions to note.\nAny Bleach\nA simple triangle means you can use any kind of bleach on that item. Just remember to follow the directions on the label.\nOnly Non-Chlorine Bleach\nA triangle with diagonal stripes means you can use non-chlorine bleach or color-safe bleach when needed.\nClorox 2® for Colors Stain Remover and Laundry Additive\nor\nClorox® ColorLoad® Non-Chlorine Bleach\nare great options when you see this symbol.\nNo Bleach\nA crossed-out triangle means you should not use any bleach of any kind on the item. There may be times you want to bleach an item with a “do not bleach” care symbol. You can always test it for colorfastness to bleach to make sure the label is correct. Sometimes clothing and textile manufacturers cut corners and put the same label on all the items in a line regardless of washability, so it’s good to check!\nDry Clean or Dry Clean Only?\nIf the label on your blouse reads “Dry Clean Only,” there you go. This indicates that the garment manufacturer has established that dry cleaning is the only safe way to wash the item. But if it says “Dry Clean” it may also be hand or machine washable in cold water — good to know if you like saving money on dry cleaning!\nRelated products\nClorox®\nColorLoad® Non-Chlorine Bleach\nLearn more\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nFrequently Asked Questions\nWho decides what laundry symbols to use?\nCare labeling is overseen by the Federal Trade Commision (FTC) under the\nCare Labeling Rule\nestablished by Congress. Textile and garment manufacturers are required to test garments to establish a reasonable basis for the care instructions that the law requires they put on clothing and home textiles. They have the option of using accepted symbols to save space.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}