{
    "url": "https://www.clorox.com/learn/how-to-clean-disinfect-baby-toys-with-bleach/",
    "title": "How to Clean and Disinfect Baby Toys with Bleach  &nbsp; | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Clean and Disinfect Baby Toys With or Without Bleach\nParents know that nothing loves baby toys more than a baby’s mouth. Learn how to disinfect toys with or without bleach to help reduce the spread of icky germs in your home.\nMore from Clorox experts\nBy\nMary Gagliardi\nDiscover more ways to clean.\nUse as directed.\nIcky germs can be especially dangerous for kids, so it's a good idea to disinfect baby toys with a\nClorox® Disinfecting Bleach\nsolution to help to reduce the spread of cold and flu viruses. You can use the same solution on high chairs, cribs, changing tables and other baby furniture.\nRelated Articles\nHow to Clean a Baby Changing Table\nHow to Clean and Sanitize a High Chair\nWhat you need\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nPlastic dishpan\nRubber gloves\nMeasuring cup\nLarge plastic spoon\nPaper towels\nSponge\nClean white towel\nSteps to disinfect baby toys with bleach\nPrepare the disinfecting bleach and water solution\nMeasure 1 gallon of water (4 quarts) into the plastic dishpan, and then add 1/3 cup bleach to the water and stir the solution with the spoon.\nPre-clean toys\nIf necessary, use a paper towel dampened with water to wipe any obvious dirt or grime off the toys before the disinfecting step.\nApply the disinfecting bleach solution\nDrop smaller toys into the bleach and water solution and stir with the spoon so all surfaces stay wet for 6 minutes. For larger toys that won’t fit easily in the dishpan, use the sponge to apply the bleach and water solution to the toy. Reapply the solution as needed to keep the toy wet for 6 minutes.\nTip\nWearing gloves, hold bath toys with air holes like rubber duckies in the solution and squeeze to work the solution inside the toy.\nThoroughly rinse each toy\nMake sure to completely rinse away the bleach solution with clean water, including squeezing clean water into and out of bath toys.\nAir dry\nLay the toys out on the clean towel and allow them to air dry.\nRelated products\nClorox®\nDisinfecting Mist, Multi-Surface\nLearn more\nBleach-free cleaning\nFor a bleach-free alternative, try\nFree & Clear Disinfecting and Sanitizing Mist\n, a germ-killing mist that’s safe around kids, pets and food.* It’s free of fragrances and dyes, and works on hard and soft surfaces.\n†\nJust spray and go, no rinse required.\nSupplies\nClorox®\nFree & Clear Disinfecting Mist\nLearn more\n*\nWhen used as directed.\n†\nWhen used as directed. See product label for list of bacteria and viruses killed on hard surfaces and bacteria killed on soft services.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}