{
    "url": "https://www.clorox.com/learn/how-to-remove-underarm-body-odor-from-clothes/",
    "title": "How to Get Body Odor and Sweat Smells Out of Clothes | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Get Body Odor and Sweat Smells Out of Clothes\nBody odor is natural but can be embarrassing. Learn how to get underarm odor out of clothes and t-shirts. Get rid of the sweat and armpit smell in your clothes.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nYou don’t have to see sweat stains to smell them, especially on lose fitting workout wear. But that sweat and perspiration can harbor odor causing bacteria. It can be hard to get these bad smells out of your clothes, especially shirts labeled “machine wash cold.” That’s where\nClorox® Fabric Sanitizer Spray\ncomes in. Use it to spot treat a single item before you add it to your laundry.\nGot a whole load of stinky workout clothes with underarm odors? Wash them all together in one load and be sure to add\nClorox® Laundry Sanitizer\nto kill 99.9% of odor causing bacteria. It’s not just for workout clothes — dress shirts, t-shirts, work shorts all can get sweaty and stinky.\nOf course when you can see stains on your colored laundry, pretreating with liquid\nClorox 2® for Colors 3 in 1\nbefore machine washing puts the power of Clorox 2® to work right on the stain where you need it. These products give you lots of options for dealing with stinky underarm odors.\nRelated Articles\nHow to Remove Deodorant and Armpit Sweat Stains from Shirts\nHow to Get Sweat Stains Out of Armpits\nPretreating underarms to remove odor\nOdor-causing bacteria that makes the underarm area of shirts smell stinky isn’t always visible, but that doesn’t stop it from smelling. Pretreating with\nClorox® Fabric Sanitizer Spray\nis the easy way to target problem odors directly.\nWhat you need\nClorox®\nFabric Sanitizer Spray\nLearn more\nLaundry detergent\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nSteps to pretreat underarms to remove odor\nTurn shirt inside out\nMake sure you can see the inside of the sleeves where the odor is strongest.\nPretreat underarm area\nSpray\nClorox® Fabric Sanitizer Spray\nonto both armpits until wet. It doesn’t matter if you can’t see any stains — just be sure to spray the whole armpit area.\nTip\nAfter spraying the inside of the shirt, turn it right side out and spray the outside of the armpits, too.\nMachine wash\nFollow the instructions on the care label for water temperature, use a good detergent, and add\nClorox 2® for Colors 3 in 1\nfor improved cleaning versus detergent alone.\nDry\nIf allowed, tumble dry following the instructions on the care label for dryer temperature. Otherwise, air dry.\nTip\nAir drying is also recommended when removing stains to make sure they are all the way out before exposing an item to dryer heat.\nRemoving body odor from a load of laundry\nWhen you have a whole load of sweaty workout clothes or other smelly laundry, adding\nClorox® Laundry Sanitizer\nto the load lets you wash everything at once and get rid of the odors.\nWhat you need\nLaundry detergent\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nClorox®\nLaundry Sanitizer\nLearn more\nSteps to remove body odor from a load of laundry\nAdd laundry to the washer\nSort dark items and mixed colors into separate loads and wash them one at a time.\nTip\nWhile you are adding your laundry to the washer, check for stains, and pretreat any you find with liquid\nClorox 2® for Colors\n.\nAdd the laundry sanitizer to the softener dispenser\nUse the softener dispenser for\nClorox® Laundry Sanitizer\n. This ensures that it is added at the correct time in the wash cycle: during the rinse cycle, not during the wash cycle.\nAdd laundry detergent and Clorox 2® for Colors\nAdd laundry detergent and\nClorox 2® for Colors 3 in 1\ntogether in the detergent dispenser compartment. If using laundry pods, toss them in the washer before adding the laundry.\nTip\nWhen using color safe bleach to improve detergent performance, always match product forms: liquid and liquid or powder and powder.\nSelect the wash cycle and start the washer\nSelect water temperature and cycle settings that follow care label instructions, and then start the washer.\nDry\nIf allowed, tumble dry following the instructions on the care label for dryer temperature. Otherwise, air dry.\nTip\nAir drying is also recommended when removing stains to make sure they are all the way out before exposing an item to dryer heat.\nFrequently Asked Questions\nHow do you get odor out of white clothes with spandex?\nYou cannot wash white clothing that contains even a small amount of spandex with\nRegular Bleach\n. Instead, use\nClorox® Laundry Sanitizer\nor\nClorox® Fabric Sanitizer Spray\nto remove odors from white clothing with spandex.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}