{
    "url": "https://www.clorox.com/learn/how-to-remove-deodorant-buildup-stains-from-armpits/",
    "title": "How to Remove Deodorant and Armpit Sweat Stains from Shirts | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\nHow to Remove Deodorant and Armpit Sweat Stains from Shirts\nSweaty underarm stains are unique to a person’s body chemistry, activity level, deodorant and wash habits. Learn how to get rid of these stains on clothes, then make some changes to prevent them.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\nEvery underarm stain is unique. The deodorant you use, how much you sweat, your personal hygiene routine and laundry habits can all factor into the armpit stain equation. Once the stains build up, they’re very difficult to remove because the crusty combination of deodorant residue, sweat and body soil doesn’t easily dissolve in water.\nTip\nThis solution should only be used on white items.\nWhat you need\nCollect all your white shirts with underarm stains, gather the tools and supplies you’ll need, boil some water, and get started.\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\nClorox 2® for Colors\nStain Remover and Laundry Additive\nLearn more\nBaking soda\n0.5 cup\n3% hydrogen peroxide\n0.5 cup\nWater\n0.5 cup\nTea kettle\nPlastic dishpan\n2 cup capacity measuring cup\nHeat-proof kitchen tongs\nHeat-proof kitchen gloves\nSteps to remove deodorant buildup\nMix up the peroxide/baking soda solution\nAdd ½ cup hydrogen peroxide, ½ cup baking soda, and ½ cup tap water together in a measuring cup and stir to dissolve.\nBring water to a boil\nFill the tea kettle all the way — it’s normal to use a lot of water.\nPlace the shirt in the plastic dishpan\nArrange the shirt with the inside of the armpits positioned on top. This way you can get to each stain without moving the shirt.\nPour boiling water onto each armpit stain\nThis is to “melt” any build-up. Pour the water slowly; the teakettle helps control the rate of the pour.\nBe careful when working with boiling hot water.\nPour off some of the hot water\nPour off as much of the hot water as you can without moving the shirt. Work quickly to keep the stains in a more melted state. If you do need to handle the shirt either use kitchen tongs or wear gloves.\nApply the peroxide/baking soda mixture\nPour the mixture directly onto the stains. Let the solution stay on the stains for 5 minutes.\nMachine wash the shirt\nUse hot water, a good detergent and the appropriate bleach for the fiber content of the shirt:\nFor white cotton or polyester shirts, add 1/3 cup\nClorox® Bleach\nFor white items with spandex, add\nClorox 2® for Colors\nAir dry the shirt\nReally crusty stains will likely need multiple treatments to remove the buildup. Keeping the shirt out of a hot dryer will help.\nSuggestions for buildup prevention\nThese stains don’t happen overnight; you may need to try a different brand of deodorant or antiperspirant if the problem persists. And you can often prevent crusty underarm stains by adjusting your laundry habits:\nDon’t overload the washer\nClothing needs to tumble or circulate easily through the wash water for proper cleaning.\nWash using hot water\nWhen washing white items, always select hot water and a heavy duty cycle for the best cleaning. Air dry if you’re worried about shrinkage.\nUse a good detergent\nCheck the ingredient list for enzymes, and make sure you add the recommended amount.\nAlways add bleach\nUse the appropriate laundry bleach along with your detergent every time you wash a load of laundry. Use\nClorox® Bleach\nfor cotton and polyester, and\nClorox 2® for Colors\nfor any white items that include a little spandex.\nAnd If you don’t know a lot about using bleach, brush up on the basics with our\nHow to Use Bleach in Laundry\nand\nWhat Is Color Safe Bleach and How To Use It\narticles.\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}