{
    "url": "https://www.clorox.com/learn/5-pet-safe-germ-killing-tips-for-healthy-pets/",
    "title": "5 Pet Safe Germ-Killing Tips for Healthy Pets | Clorox®",
    "body": "Family of Brands\nProducts\nLearn\nOur Purpose\nSearch\nSearch\n5 Pet Safe Germ-Killing Tips for Healthy Pets\nYour pets are part of your family. Check out these 5 simple tips from an expert veterinarian on how to kill germs and keep your pets safe and healthy.\nMore from Clorox experts\nDiscover more ways to clean.\nUse as directed.\n5 steps to help keep your furry family from germs.\nAn imaginary stethoscope to a real one\nMy love for animals developed long before I pursued a career in protecting their health. I grew up with pets and always loved spending time with them, whether that was playing in the yard with them or using an imaginary stethoscope to check on their well-being.\nNow, as a\nveterinarian\n, I have the unique pleasure of working with animals of all shapes and sizes. And, still a dog and cat owner, I understand how important our furry companions are, and keeping all my family members happy and healthy is my number one priority.\nGerms love animals, too\nPets, just like humans, are susceptible to bacteria and viruses. Germs do not judge and they love our furry counterparts as much as they love us! Canine parvovirus, also known as parvo, is one of them. This highly contagious, sometimes fatal viral disease is one of the most common causes of severe diarrhea in dogs under 6 months of age and can also affect adult dogs.\nHow to prevent the spread of parvovirus\nAs a veterinary student, I learned that parvo spreads rapidly from dog to dog in confined spaces such as animal shelters, veterinary hospitals or kennels — mainly through their exposure to contaminated feces\n1\n. To help prevent the spread of parvo it is critical to clean and disinfect the entire facility when a dog is sick.\n2\nMany shelters across the country rely on\nClorox® Disinfecting Bleach\n, because it is a simple and inexpensive way to help prevent the spread of parvo and other viruses. You can also use it at home to help kill germs that might be hiding inside your pet’s favorite areas and accessories or on their favorite toy.\nDr. Jessica Vogelsang’s photo courtesy of Paul Barnett Photo.\n5 steps to keep your pets happy and healthy\nAs a pet owner and a veterinarian, I use the following steps to help keep my pet happy and healthy:\nVaccinate — I cannot emphasize enough the importance of vaccinations for your pets. All dogs need to be vaccinated for parvo, distemper, rabies and adenovirus. Cats should be vaccinated for panleukopenia, calicivirus, feline herpes virus type I and rabies. Your veterinarian is the best guide in determining the timing of vaccinations for dogs, cats and other pets.\nDiscover — Before fighting germs at home, you must first identify where those germs are living. Your pet’s favorite areas in your home? Their favorite toy hiding under the couch? Make a list of every place and every object your pet has touched or been. Be sure to think like a detective, too. If your canine counterpart enjoys drinking from the porcelain throne, be sure to add that to your list of culprits as well!\nDisinfect — Use\nClorox® Disinfecting Bleach\nto disinfect hard, nonporous surfaces and accessories like crates and toys on a\nregular basis\n.\n3\nTo kill parvo, use a solution of ½ cup of bleach in 1 gallon of water. Soak the items in the solution for 10 minutes, then rinse and air dry.\n4\nBe Informed — Germs can survive in the environment for a long time. This is especially true in spaces where pets are constantly coming in and out. Before dropping your beloved at the vet or a kennel, don’t be afraid to ask what measures they are taking to prevent the spread of germs.\nMake It Routine — Getting your pet vaccinated, disinfecting their belongings, and asking their care providers the right questions is just the beginning. It’s important to always keep your pet’s health in check — from basic teeth cleanings that eliminate germs living in their mouth, to monthly heartworm prevention medication, to keep the little hearts we love so much, healthy.\nThey say that an ounce of prevention is worth a pound of cure, and this is especially true when it comes to your pets!\nKeep those tails wagging — Clorox® Disinfecting Bleach helps keep pets happy & healthy.\nPre-wash\nTo pre-wash pet-loved surfaces, soak or wipe with a detergent solution, then rinse.\nDisinfect with Clorox® Disinfecting Bleach\nFor general disinfecting of hard, nonporous surfaces and accessories, use a solution of ⅓ cup of bleach in 1 gallon of water. Soak the items for 6 minutes, then rinse and air dry.\nTo kill parvo, use a solution of ½ cup of bleach in 1 gallon of water. Soak the items in the solution for 10 minutes, then rinse and air dry.\n4\nSanitize\nWash bowls and rinse. Fill bowls: 2 teaspoons of\nClorox® Disinfecting Bleach\nper gallon of water. Wait 2 minutes. Rinse, air dry.\nRelated products\nClorox®\nDisinfecting Bleach with CLOROMAX® - Concentrated Formula\nLearn more\n1.\nhttps://www.aspcapro.org/resource/tips-prevent-and-manage-canine-parvovirus-shelter\n. Canine Parvovirus requires a 10 min contact time of Clorox® Disinfecting Bleach in order to be effective against this organism.\n2.\nhttps://www.aspcapro.org/resource/tips-prevent-and-manage-canine-parvovirus-shelter\n3.\nClorox Master Label\n4.\nhttps://www.clorox.com/learn/does-bleach-kill-parvo-on-surfaces/\nGet the Clorox newsletter for tips & updates.\nSubscribe\nBy signing up, you agree to the\nTerms of Use\nand\nPrivacy Policy\n.\nSubscribe for tips & offers\nFollow us\nPool & Spa\nPine-Sol®\nFormula 409\nLiquid-Plumr\nProducts\nWipes\nSprays\nBleach\nBathroom\nLaundry\nKitchen\nAll Products\nLearn\nCleaning Floors\nLaundry Tips\nRemoving Stains\nKitchen Cleaning\nUsing Bleach\nCompany\nStart Clean\nCareers\nHelp\nEn Español\nContact Us\nFAQs\nAn important safety message\nBleach and other disinfectants are not suitable for consumption or injection under any circumstances. People should always read the label for proper usage instructions. Disinfecting surfaces with bleach and the disinfecting products is one of the ways to help stop the spread of COVID-19, according to the Centers for Disease Control. Our products are safe when used as directed. It’s critical that everyone understands the facts in order to keep themselves safe and healthy.\nAccessibility statement\nClorox is committed to making its website accessible for all users, and will continue to take steps necessary to ensure compliance with applicable laws.\nIf you have difficulty accessing any content, feature or functionality on our website or on our other electronic platforms, please call us at\n1-800-227-1860\nso that we can provide you access through an alternative method.\n© 2024 The Clorox Company\nSafer Choice\nTerms of Use\nPrivacy Policy\nCookie Settings\nYour Privacy Choices\nFamily of Brands"
}